{"data":[{"index":"3706","surah":"36","aya":"1","text":"یٰسٓ"},{"index":"3707","surah":"36","aya":"2","text":"قسم ہے قرآن کی جو حکمت سے بھرا ہوا ہے"},{"index":"3708","surah":"36","aya":"3","text":"اے محمدﷺ) بےشک تم پیغمبروں میں سے ہو"},{"index":"3709","surah":"36","aya":"4","text":"سیدھے رستے پر"},{"index":"3710","surah":"36","aya":"5","text":"یہ خدائے) غالب (اور) مہربان نے نازل کیا ہے"},{"index":"3711","surah":"36","aya":"6","text":"تاکہ تم ان لوگوں کو جن کے باپ دادا کو متنبہ نہیں کیا گیا تھا متنبہ کردو وہ غفلت میں پڑے ہوئے ہیں"},{"index":"3712","surah":"36","aya":"7","text":"ان میں سے اکثر پر (خدا کی) بات پوری ہوچکی ہے سو وہ ایمان نہیں لائیں گے"},{"index":"3713","surah":"36","aya":"8","text":"ہم نے ان کی گردنوں میں طوق ڈال رکھے ہیں اور وہ ٹھوڑیوں تک (پھنسے ہوئے ہیں) تو ان کے سر اُلل رہے ہیں"},{"index":"3714","surah":"36","aya":"9","text":"اور ہم نے ان کے آگے بھی دیوار بنا دی اور ان کے پیچھے بھی۔ پھر ان پر پردہ ڈال دیا تو یہ دیکھ نہیں سکتے"},{"index":"3715","surah":"36","aya":"10","text":"اور تم ان کو نصیحت کرو یا نہ کرو ان کے لئے برابر ہے وہ ایمان نہیں لانے کے"},{"index":"3716","surah":"36","aya":"11","text":"تم تو صرف اس شخص کو نصیحت کرسکتے ہو جو نصیحت کی پیروی کرے اور خدا سے غائبانہ ڈرے سو اس کو مغفرت اور بڑے ثواب کی بشارت سنا دو"},{"index":"3717","surah":"36","aya":"12","text":"بےشک ہم مردوں کو زندہ کریں گے اور جو کچھ وہ آگے بھیج چکے اور (جو) ان کے نشان پیچھے رہ گئے ہم ان کو قلمبند کرلیتے ہیں۔ اور ہر چیز کو ہم نے کتاب روشن (یعنی لوح محفوظ) میں لکھ رکھا ہے۔"},{"index":"3718","surah":"36","aya":"13","text":"اور ان سے گاؤں والوں کا قصہ بیان کرو جب ان کے پاس پیغمبر آئے"},{"index":"3719","surah":"36","aya":"14","text":"(یعنی) جب ہم نے ان کی طرف دو (پیغمبر) بھیجے تو انہوں نے ان کو جھٹلایا۔ پھر ہم نے تیسرے سے تقویت دی تو انہوں نے کہا کہ ہم تمہاری طرف پیغمبر ہو کر آئے ہیں"},{"index":"3720","surah":"36","aya":"15","text":"وہ بولے کہ تم (اور کچھ) نہیں مگر ہماری طرح کے آدمی (ہو) اور خدا نے کوئی چیز نازل نہیں کی تم محض جھوٹ بولتے ہو"},{"index":"3721","surah":"36","aya":"16","text":"انہوں نے کہا کہ ہمارا پروردگار جانتا ہے کہ ہم تمہاری طرف (پیغام دے کر) بھیجے گئے ہیں"},{"index":"3722","surah":"36","aya":"17","text":"اور ہمارے ذمے تو صاف صاف پہنچا دینا ہے اور بس"},{"index":"3723","surah":"36","aya":"18","text":"وہ بولے کہ ہم تم کو نامبارک سمجھتے ہیں۔ اگر تم باز نہ آؤ گے تو ہم تمہیں سنگسار کردیں گے اور تم کو ہم سے دکھ دینے والا عذاب پہنچے گا"},{"index":"3724","surah":"36","aya":"19","text":"انہوں نے کہا کہ تمہاری نحوست تمہارے ساتھ ہے۔ کیا اس لئے کہ تم کو نصیحت کی گئی۔ بلکہ تم ایسے لوگ ہو جو حد سے تجاوز کر گئے ہو"},{"index":"3725","surah":"36","aya":"20","text":"اور شہر کے پرلے کنارے سے ایک آدمی دوڑتا ہوا آیا کہنے لگا کہ اے میری قوم پیغمبروں کے پیچھے چلو"},{"index":"3726","surah":"36","aya":"21","text":"ایسوں کے جو تم سے صلہ نہیں مانگتے اور وہ سیدھے رستے پر ہیں"},{"index":"3727","surah":"36","aya":"22","text":"اور مجھے کیا ہے میں اس کی پرستش نہ کروں جس نے مجھے پیدا کیا اور اسی کی طرف تم کو لوٹ کر جانا ہے"},{"index":"3728","surah":"36","aya":"23","text":"کیا میں ان کو چھوڑ کر اوروں کو معبود بناؤں؟ اگر خدا میرے حق میں نقصان کرنا چاہے تو ان کی سفارش مجھے کچھ بھی فائدہ نہ دے سکے اور نہ وہ مجھ کو چھڑا ہی سکیں"},{"index":"3729","surah":"36","aya":"24","text":"تب تو میں صریح گمراہی میں مبتلا ہوگیا"},{"index":"3730","surah":"36","aya":"25","text":"میں تمہارے پروردگار پر ایمان لایا ہوں سو میری بات سن رکھو"},{"index":"3731","surah":"36","aya":"26","text":"حکم ہوا کہ بہشت میں داخل ہوجا۔ بولا کاش! میری قوم کو خبر ہو"},{"index":"3732","surah":"36","aya":"27","text":"کہ خدا نے مجھے بخش دیا اور عزت والوں میں کیا"},{"index":"3733","surah":"36","aya":"28","text":"اور ہم نے اس کے بعد اس کی قوم پر کوئی لشکر نہیں اُتارا اور نہ ہم اُتارنے والے تھے ہی"},{"index":"3734","surah":"36","aya":"29","text":"وہ تو صرف ایک چنگھاڑ تھی (آتشین) سو وہ (اس سے) ناگہاں بجھ کر رہ گئے"},{"index":"3735","surah":"36","aya":"30","text":"بندوں پر افسوس ہے کہ ان کے پاس کوئی پیغمبر نہیں آتا مگر اس سے تمسخر کرتے ہیں"},{"index":"3736","surah":"36","aya":"31","text":"کیا انہوں نے نہیں دیکھا کہ ہم نے ان سے پہلے بہت سے لوگوں کو ہلاک کردیا تھا اب وہ ان کی طرف لوٹ کر نہیں آئیں گے"},{"index":"3737","surah":"36","aya":"32","text":"اور سب کے سب ہمارے روبرو حاضر کيے جائیں گے"},{"index":"3738","surah":"36","aya":"33","text":"اور ایک نشانی ان کے لئے زمین مردہ ہے کہ ہم نے اس کو زندہ کیا اور اس میں سے اناج اُگایا۔ پھر یہ اس میں سے کھاتے ہیں"},{"index":"3739","surah":"36","aya":"34","text":"اور اس میں کھجوروں اور انگوروں کے باغ پیدا کیے اور اس میں چشمے جاری کردیئے"},{"index":"3740","surah":"36","aya":"35","text":"تاکہ یہ ان کے پھل کھائیں اور ان کے ہاتھوں نے تو ان کو نہیں بنایا تو پھر یہ شکر کیوں نہیں کرتے؟"},{"index":"3741","surah":"36","aya":"36","text":"وہ خدا پاک ہے جس نے زمین کی نباتات کے اور خود ان کے اور جن چیزوں کی ان کو خبر نہیں سب کے جوڑے بنائے"},{"index":"3742","surah":"36","aya":"37","text":"اور ایک نشانی ان کے لئے رات ہے کہ اس میں سے ہم دن کو کھینچ لیتے ہیں تو اس وقت ان پر اندھیرا چھا جاتا ہے"},{"index":"3743","surah":"36","aya":"38","text":"اور سورج اپنے مقرر رستے پر چلتا رہتا ہے۔ یہ (خدائے) غالب اور دانا کا (مقرر کیا ہوا) اندازہ ہے"},{"index":"3744","surah":"36","aya":"39","text":"اور چاند کی بھی ہم نے منزلیں مقرر کردیں یہاں تک کہ (گھٹتے گھٹتے) کھجور کی پرانی شاخ کی طرح ہو جاتا ہے"},{"index":"3745","surah":"36","aya":"40","text":"نہ تو سورج ہی سے ہوسکتا ہے کہ چاند کو جا پکڑے اور نہ رات ہی دن سے پہلے آسکتی ہے۔ اور سب اپنے اپنے دائرے میں تیر رہے ہیں"},{"index":"3746","surah":"36","aya":"41","text":"اور ایک نشانی ان کے لئے یہ ہے کہ ہم نے ان کی اولاد کو بھری ہوئی کشتی میں سوار کیا"},{"index":"3747","surah":"36","aya":"42","text":"اور ان کے لئے ویسی ہی اور چیزیں پیدا کیں جن پر وہ سوار ہوتے ہیں"},{"index":"3748","surah":"36","aya":"43","text":"اور اگر ہم چاہیں تو ان کو غرق کردیں۔ پھر نہ تو ان کا کوئی فریاد رس ہوا اور نہ ان کو رہائی ملے"},{"index":"3749","surah":"36","aya":"44","text":"مگر یہ ہماری رحمت اور ایک مدت تک کے فائدے ہیں"},{"index":"3750","surah":"36","aya":"45","text":"اور جب ان سے کہا جاتا ہے کہ جو تمہارے آگے اور جو تمہارے پیچھے ہے اس سے ڈرو تاکہ تم پر رحم کیا جائے"},{"index":"3751","surah":"36","aya":"46","text":"اور ان کے پاس ان کے پروردگار کی کوئی نشانی نہیں آتی مگر اس سے منہ پھیر لیتے ہیں"},{"index":"3752","surah":"36","aya":"47","text":"اور جب ان سے کہا جاتا ہے کہ جو رزق خدا نے تم کو دیا ہے اس میں سے خرچ کرو۔ تو کافر مومنوں سے کہتے ہیں کہ بھلا ہم ان لوگوں کو کھانا کھلائیں جن کو اگر خدا چاہتا تو خود کھلا دیتا۔ تم تو صریح غلطی میں ہو"},{"index":"3753","surah":"36","aya":"48","text":"اور کہتے ہیں اگر تم سچ کہتے ہو تو یہ وعدہ کب (پورا) ہوگا؟"},{"index":"3754","surah":"36","aya":"49","text":"یہ تو ایک چنگھاڑ کے منتظر ہیں جو ان کو اس حال میں کہ باہم جھگڑ رہے ہوں گے آپکڑے گی"},{"index":"3755","surah":"36","aya":"50","text":"پھر نہ وصیت کرسکیں گے اور نہ اپنے گھر والوں میں واپس جاسکیں گے"},{"index":"3756","surah":"36","aya":"51","text":"اور (جس وقت) صور پھونکا جائے گا یہ قبروں سے (نکل کر) اپنے پروردگار کی طرف دوڑ پڑیں گے"},{"index":"3757","surah":"36","aya":"52","text":"کہیں گے اے ہے ہمیں ہماری خوابگاہوں سے کس نے (جگا) اُٹھایا؟ یہ وہی تو ہے جس کا خدا نے وعدہ کیا تھا اور پیغمبروں نے سچ کہا تھا"},{"index":"3758","surah":"36","aya":"53","text":"صرف ایک زور کی آواز کا ہونا ہوگا کہ سب کے سب ہمارے روبرو آحاضر ہوں گے"},{"index":"3759","surah":"36","aya":"54","text":"اس روز کسی شخص پر کچھ ظلم نہیں کیا جائے گا اور تم کو بدلہ ویسا ہی ملے گا جیسے تم کام کرتے تھے"},{"index":"3760","surah":"36","aya":"55","text":"اہل جنت اس روز عیش ونشاط کے مشغلے میں ہوں گے"},{"index":"3761","surah":"36","aya":"56","text":"وہ بھی اور ان کی بیویاں بھی سایوں میں تختوں پر تکیے لگائے بیٹھے ہوں گے"},{"index":"3762","surah":"36","aya":"57","text":"وہاں ان کے لئے میوے اور جو چاہیں گے (موجود ہوگا)"},{"index":"3763","surah":"36","aya":"58","text":"پروردگار مہربان کی طرف سے سلام (کہا جائے گا)"},{"index":"3764","surah":"36","aya":"59","text":"اور گنہگارو! آج الگ ہوجاؤ"},{"index":"3765","surah":"36","aya":"60","text":"اے آدم کی اولاد ہم نے تم سے کہہ نہیں دیا تھا کہ شیطان کو نہ پوجنا وہ تمہارا کھلا دشمن ہے"},{"index":"3766","surah":"36","aya":"61","text":"اور یہ کہ میری ہی عبادت کرنا۔ یہی سیدھا رستہ ہے"},{"index":"3767","surah":"36","aya":"62","text":"اور اس نے تم میں سے بہت سی خلقت کو گمراہ کردیا تھا۔ تو کیا تم سمجھتے نہیں تھے؟"},{"index":"3768","surah":"36","aya":"63","text":"یہی وہ جہنم ہے جس کی تمہیں خبر دی جاتی ہے"},{"index":"3769","surah":"36","aya":"64","text":"(سو) جو تم کفر کرتے رہے ہو اس کے بدلے آج اس میں داخل ہوجاؤ"},{"index":"3770","surah":"36","aya":"65","text":"آج ہم ان کے مونہوں پر مہر لگا دیں گے اور جو کچھ یہ کرتے رہے تھے ان کے ہاتھ ہم سے بیان کردیں گے اور ان کے پاؤں (اس کی) گواہی دیں گے"},{"index":"3771","surah":"36","aya":"66","text":"اور اگر ہم چاہیں تو ان کی آنکھوں کو مٹا کر (اندھا کر) دیں۔ پھر یہ رستے کو دوڑیں تو کہاں دیکھ سکیں گے"},{"index":"3772","surah":"36","aya":"67","text":"اور اگر ہم چاہیں تو ان کی جگہ پر ان کی صورتیں بدل دیں پھر وہاں سے نہ آگے جاسکیں اور نہ (پیچھے) لوٹ سکیں"},{"index":"3773","surah":"36","aya":"68","text":"اور جس کو ہم بڑی عمر دیتے ہیں تو اسے خلقت میں اوندھا کردیتے ہیں تو کیا یہ سمجھتے نہیں؟"},{"index":"3774","surah":"36","aya":"69","text":"اور ہم نے ان (پیغمبر) کو شعر گوئی نہیں سکھائی اور نہ وہ ان کو شایاں ہے۔ یہ تو محض نصیحت اور صاف صاف قرآن (پُرازحکمت) ہے"},{"index":"3775","surah":"36","aya":"70","text":"تاکہ اس شخص کو جو زندہ ہو ہدایت کا رستہ دکھائے اور کافروں پر بات پوری ہوجائے"},{"index":"3776","surah":"36","aya":"71","text":"کیا انہوں نے نہیں دیکھا کہ جو چیزیں ہم نے اپنے ہاتھوں سے بنائیں ان میں سے ہم نے ان کے لئے چارپائے پیدا کر دیئے اور یہ ان کے مالک ہیں"},{"index":"3777","surah":"36","aya":"72","text":"اور ان کو ان کے قابو میں کردیا تو کوئی تو ان میں سے ان کی سواری ہے اور کسی کو یہ کھاتے ہیں"},{"index":"3778","surah":"36","aya":"73","text":"اور ان میں ان کے لئے (اور) فائدے اور پینے کی چیزیں ہیں۔ تو یہ شکر کیوں نہیں کرتے؟"},{"index":"3779","surah":"36","aya":"74","text":"اور انہوں نے خدا کے سوا (اور) معبود بنا لیے ہیں کہ شاید (ان سے) ان کو مدد پہنچے"},{"index":"3780","surah":"36","aya":"75","text":"(مگر) وہ ان کی مدد کی (ہرگز) طاقت نہیں رکھتے۔ اور وہ ان کی فوج ہو کر حاضر کیے جائیں گے"},{"index":"3781","surah":"36","aya":"76","text":"تو ان کی باتیں تمہیں غمناک نہ کردیں۔ یہ جو کچھ چھپاتے اور جو کچھ ظاہر کرتے ہیں ہمیں سب معلوم ہے"},{"index":"3782","surah":"36","aya":"77","text":"کیا انسان نے نہیں دیکھا کہ ہم نے اس کو نطفے سے پیدا کیا۔ پھر وہ تڑاق پڑاق جھگڑنے لگا"},{"index":"3783","surah":"36","aya":"78","text":"اور ہمارے بارے میں مثالیں بیان کرنے لگا اور اپنی پیدائش کو بھول گیا۔ کہنے لگا کہ (جب) ہڈیاں بوسیدہ ہوجائیں گی تو ان کو کون زندہ کرے گا؟"},{"index":"3784","surah":"36","aya":"79","text":"کہہ دو کہ ان کو وہ زندہ کرے گا جس نے ان کو پہلی بار پیدا کیا تھا۔ اور وہ سب قسم کا پیدا کرنا جانتا ہے"},{"index":"3785","surah":"36","aya":"80","text":"جس نے تمہارے لئے سبز درخت سے آگ پیدا کی پھر تم اس (کی ٹہنیوں کو رگڑ کر ان) سے آگ نکالتے ہو"},{"index":"3786","surah":"36","aya":"81","text":"بھلا جس نے آسمانوں اور زمین کو پیدا کیا، کیا وہ اس بات پر قادر نہیں کہ (ان کو پھر) ویسے ہی پیدا کر دے۔ کیوں نہیں۔ اور وہ تو بڑا پیدا کرنے والا اور علم والا ہے"},{"index":"3787","surah":"36","aya":"82","text":"اس کی شان یہ ہے کہ جب وہ کسی چیز کا ارادہ کرتا ہے تو اس سے فرما دیتا ہے کہ ہوجا تو وہ ہوجاتی ہے"},{"index":"3788","surah":"36","aya":"83","text":"وہ (ذات) پاک ہے جس کے ہاتھ میں ہر چیز کی بادشاہت ہے اور اسی کی طرف تم کو لوٹ کر جانا ہے"}]}