{"data":[{"index":"4273","surah":"42","aya":"1","text":"حٰمٓ"},{"index":"4274","surah":"42","aya":"2","text":"عٓسٓقٓ"},{"index":"4275","surah":"42","aya":"3","text":"خدائے غالب و دانا اسی طرح تمہاری طرف مضامین اور (براہین) بھیجتا ہے جس طرح تم سے پہلے لوگوں کی طرف وحی بھیجتا رہا ہے"},{"index":"4276","surah":"42","aya":"4","text":"جو کچھ آسمانوں میں اور جو کچھ زمین میں ہے سب اسی کا ہے۔ اور وہ عالی رتبہ اور گرامی قدر ہے"},{"index":"4277","surah":"42","aya":"5","text":"قریب ہے کہ آسمان اوپر سے پھٹ پڑیں اور فرشتے اپنے پروردگار کی تعریف کے ساتھ اس کی تسبیج کرتے رہتے ہیں اور جو لوگ زمین میں ہیں ان کے لئے معافی مانگتے رہتے ہیں۔ سن رکھو کہ خدا بخشنے والا مہربان ہے"},{"index":"4278","surah":"42","aya":"6","text":"اور جن لوگوں نے اس کے سوا کارساز بنا رکھے ہیں وہ خدا کو یاد ہیں۔ اور تم ان پر داروغہ نہیں ہو"},{"index":"4279","surah":"42","aya":"7","text":"اور اسی طرح تمہارے پاس قرآن عربی بھیجا ہے تاکہ تم بڑے گاؤں (یعنی مکّے) کے رہنے والوں کو اور جو لوگ اس کے اردگرد رہتے ہیں ان کو رستہ دکھاؤ اور انہیں قیامت کے دن کا بھی جس میں کچھ شک نہیں ہے خوف دلاؤ۔ اس روز ایک فریق بہشت میں ہوگا اور ایک فریق دوزخ میں"},{"index":"4280","surah":"42","aya":"8","text":"اور اگر خدا چاہتا تو ان کو ایک ہی جماعت کردیتا لیکن وہ جس کو چاہتا ہے اپنی رحمت میں داخل کرلیتا ہے اور ظالموں کا نہ کوئی یار ہے اور نہ مددگار"},{"index":"4281","surah":"42","aya":"9","text":"کیا انہوں نے اس کے سوا کارساز بنائے ہیں؟ کارساز تو خدا ہی ہے اور وہی مردوں کو زندہ کرے گا اور وہ ہر چیز پر قدرت رکھتا ہے"},{"index":"4282","surah":"42","aya":"10","text":"اور تم جس بات میں اختلاف کرتے ہو اس کا فیصلہ خدا کی طرف (سے ہوگا) یہی خدا میرا پروردگار ہے میں اسی پر بھروسہ رکھتا ہوں۔ اور اسی کی طرف رجوع کرتا ہوں"},{"index":"4283","surah":"42","aya":"11","text":"آسمانوں اور زمین کا پیدا کرنے والا (وہی ہے) ۔ اسی نے تمہارے لئے تمہاری ہی جنس کے جوڑے بنائے اور چارپایوں کے بھی جوڑے (بنائے اور) اسی طریق پر تم کو پھیلاتا رہتا ہے۔ اس جیسی کوئی چیز نہیں۔ اور وہ دیکھتا سنتا ہے"},{"index":"4284","surah":"42","aya":"12","text":"آسمانوں اور زمین کی کنجیاں اسی کے ہاتھ میں ہیں۔ وہ جس کے لئے چاہتا ہے رزق فراخ کردیتا ہے (اور جس کے لئے چاہتا ہے) تنگ کردیتا ہے۔ بےشک وہ ہر چیز سے واقف ہے"},{"index":"4285","surah":"42","aya":"13","text":"اسی نے تمہارے لئے دین کا وہی رستہ مقرر کیا جس (کے اختیار کرنے کا) نوح کو حکم دیا تھا اور جس کی (اے محمدﷺ) ہم نے تمہاری طرف وحی بھیجی ہے اور جس کا ابراہیم اور موسیٰ اور عیسیٰ کو حکم دیا تھا (وہ یہ) کہ دین کو قائم رکھنا اور اس میں پھوٹ نہ ڈالنا۔ جس چیز کی طرف تم مشرکوں کو بلاتے ہو وہ ان کو دشوار گزرتی ہے۔ الله جس کو چاہتا ہے اپنی بارگاہ کا برگزیدہ کرلیتا ہے اور جو اس کی طرف رجوع کرے اسے اپنی طرف رستہ دکھا دیتا ہے"},{"index":"4286","surah":"42","aya":"14","text":"اور یہ لوگ جو الگ الگ ہوئے ہیں تو علم (حق) آچکنے کے بعد آپس کی ضد سے (ہوئے ہیں) ۔ اور اگر تمہارے پروردگار کی طرف سے ایک وقت مقرر تک کے لئے بات نہ ٹھہر چکی ہوتی تو ان میں فیصلہ کردیا جاتا۔ اور جو لوگ ان کے بعد (خدا کی) کتاب کے وارث ہوئے وہ اس (کی طرف) سے شبہے کی الجھن میں (پھنسے ہوئے) ہیں"},{"index":"4287","surah":"42","aya":"15","text":"تو (اے محمدﷺ) اسی (دین کی) طرف (لوگوں کو) بلاتے رہنا اور جیسا تم کو حکم ہوا ہے (اسی پر) قائم رہنا۔ اور ان کی خواہشوں کی پیروی نہ کرنا۔ اور کہہ دو کہ جو کتاب خدا نے نازل فرمائی ہے میں اس پر ایمان رکھتا ہوں۔ اور مجھے حکم ہوا ہے کہ تم میں انصاف کروں۔ خدا ہی ہمارا اور تمہارا پروردگار ہے۔ ہم کو ہمارے اعمال (کا بدلہ ملے گا) اور تم کو تمہارے اعمال کا۔ ہم میں اور تم میں کچھ بحث وتکرار نہیں۔ خدا ہم (سب) کو اکھٹا کرے گا۔ اور اسی کی طرف لوٹ کر جانا ہے"},{"index":"4288","surah":"42","aya":"16","text":"اور جو لوگ خدا (کے بارے) میں بعد اس کے کہ اسے (مومنوں نے) مان لیا ہو جھگڑتے ہیں ان کے پروردگار کے نزدیک ان کا جھگڑا لغو ہے۔ اور ان پر (خدا کا) غضب اور ان کے لئے سخت عذاب ہے"},{"index":"4289","surah":"42","aya":"17","text":"خدا ہی تو ہے جس نے سچائی کے ساتھ کتاب نازل فرمائی اور (عدل وانصاف کی) ترازو۔ اور تم کو کیا معلوم شاید قیامت قریب ہی آ پہنچی ہو"},{"index":"4290","surah":"42","aya":"18","text":"جو لوگ اس پر ایمان نہیں رکھتے وہ اس کے لئے جلدی کر رہے ہیں۔ اور جو مومن ہیں وہ اس سے ڈرتے ہیں۔ اور جانتے ہیں کہ وہ برحق ہے۔ دیکھو جو لوگ قیامت میں جھگڑتے ہیں وہ پرلے درجے کی گمراہی میں ہیں"},{"index":"4291","surah":"42","aya":"19","text":"خدا اپنے بندوں پر مہربان ہے وہ جس کو چاہتا ہے رزق دیتا ہے۔ اور وہ زور والا (اور) زبردست ہے"},{"index":"4292","surah":"42","aya":"20","text":"جو شخص آخرت کی کھیتی کا خواستگار ہو اس کو ہم اس میں سے دیں گے۔ اور جو دنیا کی کھیتی کا خواستگار ہو اس کو ہم اس میں سے دے دیں گے۔ اور اس کا آخرت میں کچھ حصہ نہ ہوگا"},{"index":"4293","surah":"42","aya":"21","text":"کیا ان کے وہ شریک ہیں جنہوں نے ان کے لئے ایسا دین مقرر کیا ہے جس کا خدا نے حکم نہیں دیا۔ اور اگر فیصلے (کے دن) کا وعدہ نہ ہوتا تو ان میں فیصلہ کردیا جاتا اور جو ظالم ہیں ان کے لئے درد دینے والا عذاب ہے"},{"index":"4294","surah":"42","aya":"22","text":"تم دیکھو گے کہ ظالم اپنے اعمال (کے وبال) سے ڈر رہے ہوں گے اور وہ ان پر پڑے گا۔ اور جو لوگ ایمان لائے اور نیک عمل کرتے رہے وہ بہشت کے باغوں میں ہوں گے۔ وہ جو کچھ چاہیں گے ان کے لیے ان کے پروردگار کے پاس (موجود) ہوگا۔ یہی بڑا فضل ہے"},{"index":"4295","surah":"42","aya":"23","text":"یہی وہ (انعام ہے) جس کی خدا اپنے ان بندوں کو جو ایمان لاتے اور عمل نیک کرتے ہیں بشارت دیتا ہے۔ کہہ دو کہ میں اس کا تم سے صلہ نہیں مانگتا مگر (تم کو) قرابت کی محبت (تو چاہیئے) اور جو کوئی نیکی کرے گا ہم اس کے لئے اس میں ثواب بڑھائیں گے۔ بےشک خدا بخشنے والا قدردان ہے"},{"index":"4296","surah":"42","aya":"24","text":"کیا یہ لوگ کہتے ہیں کہ پیغمبر نے خدا پر جھوٹ باندھ لیا ہے؟ اگر خدا چاہے تو (اے محمدﷺ) تمہارے دل پر مہر لگا دے۔ اور خدا جھوٹ کو نابود کرتا اور اپنی باتوں سے حق کو ثابت کرتا ہے۔ بےشک وہ سینے تک کی باتوں سے واقف ہے"},{"index":"4297","surah":"42","aya":"25","text":"اور وہی تو ہے جو اپنے بندوں کی توبہ قبول کرتا اور (ان کے) قصور معاف فرماتا ہے اور جو تم کرتے ہو (سب) جانتا ہے"},{"index":"4298","surah":"42","aya":"26","text":"اور جو ایمان لائے اور عمل نیک کئے ان کی (دعا) قبول فرماتا ہے اور ان کو اپنے فضل سے بڑھاتا ہے۔ اور جو کافر ہیں ان کے لئے سخت عذاب ہے"},{"index":"4299","surah":"42","aya":"27","text":"اور اگر خدا اپنے بندوں کے لئے رزق میں فراخی کردیتا تو زمین میں فساد کرنے لگتے۔ لیکن وہ جو چیز چاہتا ہے اندازے کے ساتھ نازل کرتا ہے۔ بےشک وہ اپنے بندوں کو جانتا اور دیکھتا ہے"},{"index":"4300","surah":"42","aya":"28","text":"اور وہی تو ہے جو لوگوں کے ناامید ہوجانے کے بعد مینہ برساتا اور اپنی رحمت (یعنی بارش) کی برکت کو پھیلا دیتا ہے۔ اور وہ کارساز اور سزاوار تعریف ہے"},{"index":"4301","surah":"42","aya":"29","text":"اور اسی کی نشانیوں میں سے ہے آسمانوں اور زمین کا پیدا کرنا اور ان جانوروں کا جو اس نے ان میں پھیلا رکھے ہیں اور وہ جب چاہے ان کے جمع کرلینے پر قادر ہے"},{"index":"4302","surah":"42","aya":"30","text":"اور جو مصیبت تم پر واقع ہوتی ہے سو تمہارے اپنے فعلوں سے اور وہ بہت سے گناہ تو معاف ہی کردیتا ہے"},{"index":"4303","surah":"42","aya":"31","text":"اور تم زمین میں (خدا کو) عاجز نہیں کرسکتے۔ اور خدا کے سوا نہ تمہارا کوئی دوست ہے اور نہ مددگار"},{"index":"4304","surah":"42","aya":"32","text":"اور اسی کی نشانیوں میں سے سمندر کے جہاز ہیں (جو) گویا پہاڑ (ہیں)"},{"index":"4305","surah":"42","aya":"33","text":"اگر خدا چاہے تو ہوا کو ٹھیرا دے اور جہاز اس کی سطح پر کھڑے رہ جائیں۔ تمام صبر اور شکر کرنے والوں کے لئے ان (باتوں) میں قدرت خدا کے نمونے ہیں"},{"index":"4306","surah":"42","aya":"34","text":"یا ان کے اعمال کے سبب ان کو تباہ کردے۔ اور بہت سے قصور معاف کردے"},{"index":"4307","surah":"42","aya":"35","text":"اور (انتقام اس لئے لیا جائے کہ) جو لوگ ہماری آیتوں میں جھگڑتے ہیں۔ وہ جان لیں کہ ان کے لئے خلاصی نہیں"},{"index":"4308","surah":"42","aya":"36","text":"(لوگو) جو (مال ومتاع) تم کو دیا گیا ہے وہ دنیا کی زندگی کا (ناپائدار) فائدہ ہے۔ اور جو کچھ خدا کے ہاں ہے وہ بہتر اور قائم رہنے والا ہے (یعنی) ان لوگوں کے لئے جو ایمان لائے اور اپنے پروردگار پر بھروسا رکھتے ہیں"},{"index":"4309","surah":"42","aya":"37","text":"اور جو بڑے بڑے گناہوں اور بےحیائی کی باتوں سے پرہیز کرتے ہیں۔ اور جب غصہ آتا ہے تو معاف کردیتے ہیں"},{"index":"4310","surah":"42","aya":"38","text":"اور جو اپنے پروردگار کا فرمان قبول کرتے ہیں اور نماز پڑھتے ہیں۔ اور اپنے کام آپس کے مشورے سے کرتے ہیں۔ اور جو مال ہم نے ان کو عطا فرمایا ہے اس میں سے خرچ کرتے ہیں"},{"index":"4311","surah":"42","aya":"39","text":"اور جو ایسے ہیں کہ جب ان پر ظلم وتعدی ہو تو (مناسب طریقے سے) بدلہ لیتے ہیں"},{"index":"4312","surah":"42","aya":"40","text":"اور برائی کا بدلہ تو اسی طرح کی برائی ہے۔ مگر جو درگزر کرے اور (معاملے کو) درست کردے تو اس کا بدلہ خدا کے ذمے ہے۔ اس میں شک نہیں کہ وہ ظلم کرنے والوں کو پسند نہیں کرتا"},{"index":"4313","surah":"42","aya":"41","text":"اور جس پر ظلم ہوا ہو اگر وہ اس کے بعد انتقام لے تو ایسے لوگوں پر کچھ الزام نہیں"},{"index":"4314","surah":"42","aya":"42","text":"الزام تو ان لوگوں پر ہے جو لوگوں پر ظلم کرتے ہیں اور ملک میں ناحق فساد پھیلاتے ہیں۔ یہی لوگ ہیں جن کو تکلیف دینے والا عذاب ہوگا"},{"index":"4315","surah":"42","aya":"43","text":"اور جو صبر کرے اور قصور معاف کردے تو یہ ہمت کے کام ہیں"},{"index":"4316","surah":"42","aya":"44","text":"اور جس شخص کو خدا گمراہ کرے تو اس کے بعد اس کا کوئی دوست نہیں۔ اور تم ظالموں کو دیکھو گے کہ جب وہ (دوزخ کا) عذاب دیکھیں گے تو کہیں گے کیا (دنیا میں) واپس جانے کی بھی کوئی سبیل ہے؟"},{"index":"4317","surah":"42","aya":"45","text":"اور تم ان کو دیکھو گے کہ دوزخ کے سامنے لائے جائیں گے ذلت سے عاجزی کرتے ہوئے چھپی (اور نیچی) نگاہ سے دیکھ رہے ہوں گے۔ اور مومن لوگ کہیں کے کہ خسارہ اٹھانے والے تو وہ ہیں جنہوں نے قیامت کے دن اپنے آپ کو اور اپنے گھر والوں کو خسارے میں ڈالا۔ دیکھو کہ بےانصاف لوگ ہمیشہ کے دکھ میں (پڑے) رہیں گے"},{"index":"4318","surah":"42","aya":"46","text":"اور خدا کے سوا ان کے کوئی دوست نہ ہوں گے کہ خدا کے سوا ان کو مدد دے سکیں۔ اور جس کو خدا گمراہ کرے اس کے لئے (ہدایت کا) کوئی رستہ نہیں"},{"index":"4319","surah":"42","aya":"47","text":"ان سے کہہ دو کہ) قبل اس کے کہ وہ دن جو ٹلے گا نہیں خدا کی طرف سے آ موجود ہو اپنے پروردگار کا حکم قبول کرو۔ اس دن تمہارے لئے نہ کوئی جائے پناہ ہوگی اور نہ تم سے گناہوں کا انکار ہی بن پڑے گا"},{"index":"4320","surah":"42","aya":"48","text":"پھر اگر یہ منہ پھیر لیں تو ہم نے تم کو ان پر نگہبان بنا کر نہیں بھیجا۔ تمہارا کام تو صرف (احکام کا) پہنچا دینا ہے۔ اور جب ہم انسان کو اپنی رحمت کا مزہ چکھاتے ہیں تو اس سے خوش ہوجاتا ہے۔ اور اگر ان کو ان ہی کے اعمال کے سبب کوئی سختی پہنچتی ہے تو (سب احسانوں کو بھول جاتے ہیں) بےشک انسان بڑا ناشکرا ہے"},{"index":"4321","surah":"42","aya":"49","text":"(تمام) بادشاہت خدا ہی کی ہے آسمانوں کی بھی اور زمین کی بھی۔ وہ جو چاہتا ہے پیدا کرتا ہے۔ جسے چاہتا ہے بیٹیاں عطا کرتا ہے اور جسے چاہتا ہے بیٹے بخشتا ہے"},{"index":"4322","surah":"42","aya":"50","text":"یا ان کو بیٹے اور بیٹیاں دونوں عنایت فرماتا ہے۔ اور جس کو چاہتا ہے بےاولاد رکھتا ہے۔ وہ تو جاننے والا (اور) قدرت والا ہے"},{"index":"4323","surah":"42","aya":"51","text":"اور کسی آدمی کے لئے ممکن نہیں کہ خدا اس سے بات کرے مگر الہام (کے ذریعے) سے یا پردے کے پیچھے سے یا کوئی فرشتہ بھیج دے تو وہ خدا کے حکم سے جو خدا چاہے القا کرے۔ بےشک وہ عالی رتبہ (اور) حکمت والا ہے"},{"index":"4324","surah":"42","aya":"52","text":"اور اسی طرح ہم نے اپنے حکم سے تمہاری طرف روح القدس کے ذریعے سے (قرآن) بھیجا ہے۔ تم نہ تو کتاب کو جانتے تھے اور نہ ایمان کو۔ لیکن ہم نے اس کو نور بنایا ہے کہ اس سے ہم اپنے بندوں میں سے جس کو چاہتے ہیں ہدایت کرتے ہیں۔ اور بےشک (اے محمدﷺ) تم سیدھا رستہ دکھاتے ہو"},{"index":"4325","surah":"42","aya":"53","text":"(یعنی) خدا کا رستہ جو آسمانوں اور زمین کی سب چیزوں کا مالک ہے۔ دیکھو سب کام خدا کی طرف رجوع ہوں گے (اور وہی ان میں فیصلہ کرے گا)"}]}