{"data":[{"index":"2030","surah":"17","aya":"1","text":"وہ (ذات) پاک ہے جو ایک رات اپنے بندے کو مسجدالحرام یعنی (خانہٴ کعبہ) سے مسجد اقصیٰ (یعنی بیت المقدس) تک جس کے گردا گرد ہم نے برکتیں رکھی ہیں لے گیا تاکہ ہم اسے اپنی (قدرت کی) نشانیاں دکھائیں۔ بےشک وہ سننے والا (اور) دیکھنے والا ہے"},{"index":"2031","surah":"17","aya":"2","text":"اور ہم نے موسیٰ کو کتاب عنایت کی تھی اور اس کو بنی اسرائیل کے لئے رہنما مقرر کیا تھا کہ میرے سوا کسی کو کارساز نہ ٹھہرانا"},{"index":"2032","surah":"17","aya":"3","text":"اے اُن لوگوں کی اولاد جن کو ہم نے نوح کے ساتھ (کشتی میں) سوار کیا تھا۔ بےشک نوح (ہمارے) شکرگزار بندے تھے"},{"index":"2033","surah":"17","aya":"4","text":"اور ہم نے کتاب میں بنی اسرائیل سے کہہ دیا تھا کہ زمین میں دو دفعہ فساد مچاؤ گے اور بڑی سرکشی کرو گے"},{"index":"2034","surah":"17","aya":"5","text":"پس جب پہلے (وعدے) کا وقت آیا تو ہم نے سخت لڑائی لڑنے والے بندے تم پر مسلط کردیئے اور وہ شہروں کے اندر پھیل گئے۔ اور وہ وعدہ پورا ہو کر رہا"},{"index":"2035","surah":"17","aya":"6","text":"پھر ہم نے دوسری بات تم کو اُن پر غلبہ دیا اور مال اور بیٹوں سے تمہاری مدد کی۔ اور تم کو جماعت کثیر بنا دیا"},{"index":"2036","surah":"17","aya":"7","text":"اگر تم نیکوکاری کرو گے تو اپنی جانوں کے لئے کرو گے۔ اور اگر اعمال بد کرو گے تو (اُن کا) وبال بھی تمہاری ہی جانوں پر ہوگا پھر جب دوسرے (وعدے) کا وقت آیا (تو ہم نے پھر اپنے بندے بھیجے) تاکہ تمہارے چہروں کو بگاڑ دیں اور جس طرح پہلی دفعہ مسجد (بیت المقدس) میں داخل ہوگئے تھے اسی طرح پھر اس میں داخل ہوجائیں اور جس چیز پر غلبہ پائیں اُسے تباہ کردیں"},{"index":"2037","surah":"17","aya":"8","text":"امید ہے کہ تمہارا پروردگار تم پر رحم کرے، اور اگر تم پھر وہی (حرکتیں) کرو گے تو ہم بھی (وہی پہلا سلوک) کریں گے اور ہم نے جہنم کو کافروں کے لئے قید خانہ بنا رکھا ہے"},{"index":"2038","surah":"17","aya":"9","text":"یہ قرآن وہ رستہ دکھاتا ہے جو سب سے سیدھا ہے اور مومنوں کو جو نیک عمل کرتے ہیں بشارت دیتا ہے کہ اُن کے لئے اجر عظیم ہے"},{"index":"2039","surah":"17","aya":"10","text":"اور یہ بھی (بتاتا ہے) کہ جو آخرت پر ایمان نہیں رکھتے اُن کے لئے ہم نے دکھ دینے والا عذاب تیار کر رکھا ہے"},{"index":"2040","surah":"17","aya":"11","text":"اور انسان جس طرح (جلدی سے) بھلائی مانگتا ہے اسی طرح برائی مانگتا ہے۔ اور انسان جلد باز (پیدا ہوا) ہے"},{"index":"2041","surah":"17","aya":"12","text":"اور ہم نے دن اور رات کو دو نشانیاں بنایا ہے رات کی نشانی کو تاریک بنایا اور دن کی نشانی کو روشن۔ تاکہ تم اپنے پروردگار کا فضل (یعنی) روزی تلاش کرو اور برسوں کا شمار اور حساب جانو۔ اور ہم نے ہر چیز کو (بخوبی) تفصیل کردی ہے"},{"index":"2042","surah":"17","aya":"13","text":"اور ہم نے ہر انسان کے اعمال کو (بہ صورت کتاب) اس کے گلے میں لٹکا دیا ہے۔ اور قیامت کے روز (وہ) کتاب اسے نکال دکھائیں گے جسے وہ کھلا ہوا دیکھے گا"},{"index":"2043","surah":"17","aya":"14","text":"(کہا جائے گا کہ) اپنی کتاب پڑھ لے۔ تو آج اپنا آپ ہی محاسب کافی ہے"},{"index":"2044","surah":"17","aya":"15","text":"جو شخص ہدایت اختیار کرتا ہے تو اپنے لئے اختیار کرتا ہے۔ اور جو گمراہ ہوتا ہے گمراہی کا ضرر بھی اسی کو ہوگا۔ اور کوئی شخص کسی دوسرے کا بوجھ نہیں اٹھائے گا۔ اور جب تک ہم پیغمبر نہ بھیج لیں عذاب نہیں دیا کرتے"},{"index":"2045","surah":"17","aya":"16","text":"اور جب ہمارا ارادہ کسی بستی کے ہلاک کرنے کا ہوا تو وہاں کے آسودہ لوگوں کو (فواحش پر) مامور کردیا تو وہ نافرمانیاں کرتے رہے۔ پھر اس پر (عذاب کا) حکم ثابت ہوگیا۔ اور ہم نے اسے ہلاک کر ڈالا"},{"index":"2046","surah":"17","aya":"17","text":"اور ہم نے نوح کے بعد بہت سی اُمتوں کو ہلاک کر ڈالا۔ اور تمہارا پروردگار اپنے بندوں کے گناہوں کو جاننے اور دیکھنے والا کافی ہے"},{"index":"2047","surah":"17","aya":"18","text":"جو شخص دنیا (کی آسودگی) کا خواہشمند ہو تو ہم اس میں سے جسے چاہتے ہیں اور جتنا چاہتے ہیں جلد دے دیتے ہیں۔ پھر اس کے لئے جہنم کو (ٹھکانا) مقرر کر رکھا ہے۔ جس میں وہ نفرین سن کر اور (درگاہ خدا سے) راندہ ہو کر داخل ہوگا"},{"index":"2048","surah":"17","aya":"19","text":"اور جو شخص آخرت کا خواستگار ہوا اور اس میں اتنی کوشش کرے جتنی اسے لائق ہے اور وہ مومن بھی ہو تو ایسے ہی لوگوں کی کوشش ٹھکانے لگتی ہے"},{"index":"2049","surah":"17","aya":"20","text":"ہم اُن کو اور ان کو سب کو تمہارے پروردگار کی بخشش سے مدد دیتے ہیں۔ اور تمہارے پروردگار کی بخشش (کسی سے) رکی ہوئی نہیں"},{"index":"2050","surah":"17","aya":"21","text":"دیکھو ہم نے کس طرح بعض کو بعض پر فضیلت بخشی ہے۔ اور آخرت درجوں میں (دنیا سے) بہت برتر اور برتری میں کہیں بڑھ کر ہے"},{"index":"2051","surah":"17","aya":"22","text":"اور خدا کے ساتھ کوئی اور معبود نہ بنانا کہ ملامتیں سن کر اور بےکس ہو کر بیٹھے رہ جاؤ گے"},{"index":"2052","surah":"17","aya":"23","text":"اور تمہارے پروردگار نے ارشاد فرمایا ہے کہ اس کے سوا کسی کی عبادت نہ کرو اور ماں باپ کے ساتھ بھلائی کرتے رہو۔ اگر ان میں سے ایک یا دونوں تمہارے سامنے بڑھاپے کو پہنچ جائیں تو اُن کو اُف تک نہ کہنا اور نہ انہیں جھڑکنا اور اُن سے بات ادب کے ساتھ کرنا"},{"index":"2053","surah":"17","aya":"24","text":"اور عجزو نیاز سے ان کے آگے جھکے رہو اور ان کے حق میں دعا کرو کہ اے پروردگار جیسا انہوں نے مجھے بچپن میں (شفقت سے) پرورش کیا ہے تو بھی اُن (کے حال) پر رحمت فرما"},{"index":"2054","surah":"17","aya":"25","text":"جو کچھ تمہارے دلوں میں ہے تمہارا پروردگار اس سے بخوبی واقف ہے۔ اگر تم نیک ہوگے تو وہ رجوع لانے والوں کو بخش دینے والا ہے"},{"index":"2055","surah":"17","aya":"26","text":"اور رشتہ داروں اور محتاجوں اور مسافروں کو ان کا حق ادا کرو۔ اور فضول خرچی سے مال نہ اُڑاؤ"},{"index":"2056","surah":"17","aya":"27","text":"کہ فضول خرچی کرنے والے تو شیطان کے بھائی ہیں۔ اور شیطان اپنے پروردگار (کی نعمتوں) کا کفر ان کرنے والا (یعنی ناشکرا) ہے"},{"index":"2057","surah":"17","aya":"28","text":"اور اگر تم نے اپنے پروردگار کی رحمت (یعنی فراخ دستی) کے انتظار میں جس کی تمہیں امید ہو ان (مستحقین) کی طرف توجہ نہ کرسکو اُن سے نرمی سے بات کہہ دیا کرو"},{"index":"2058","surah":"17","aya":"29","text":"اور اپنے ہاتھ کو نہ تو گردن سے بندھا ہوا (یعنی بہت تنگ) کرلو (کہ کسی کچھ دو ہی نہیں) اور نہ بالکل کھول ہی دو (کہ سبھی دے ڈالو اور انجام یہ ہو) کہ ملامت زدہ اور درماندہ ہو کر بیٹھ جاؤ"},{"index":"2059","surah":"17","aya":"30","text":"بےشک تمہارا پروردگار جس کی روزی چاہتا ہے فراخ کردیتا ہے اور (جس کی روزی چاہتا ہے) تنگ کردیتا ہے وہ اپنے بندوں سے خبردار ہے اور (ان کو) دیکھ رہا ہے"},{"index":"2060","surah":"17","aya":"31","text":"اور اپنی اولاد کو مفلسی کے خوف سے قتل نہ کرنا۔ (کیونکہ) ان کو اور تم کو ہم ہی رزق دیتے ہیں۔ کچھ شک نہیں کہ ان کا مار ڈالنا بڑا سخت گناہ ہے"},{"index":"2061","surah":"17","aya":"32","text":"اور زنا کے بھی پاس نہ جانا کہ وہ بےحیائی اور بری راہ ہے"},{"index":"2062","surah":"17","aya":"33","text":"اور جس کا جاندار کا مارنا خدا نے حرام کیا ہے اسے قتل نہ کرنا مگر جائز طور پر (یعنی بفتویٰ شریعت) ۔ اور جو شخص ظلم سے قتل کیا جائے ہم نے اس کے وارث کو اختیار دیا ہے (کہ ظالم قاتل سے بدلہ لے) تو اس کو چاہیئے کہ قتل (کے قصاص) میں زیادتی نہ کرے کہ وہ منصورو فتحیاب ہے"},{"index":"2063","surah":"17","aya":"34","text":"اور یتیم کے مال کے پاس بھی نہ پھٹکنا مگر ایسے طریق سے کہ بہت بہتر ہو یہاں تک کہ ہو جوانی کو پہنچ جائے۔ اور عہد کو پورا کرو کہ عہد کے بارے میں ضرور پرسش ہوگی"},{"index":"2064","surah":"17","aya":"35","text":"اور جب (کوئی چیز) ناپ کر دینے لگو تو پیمانہ پورا بھرا کرو اور (جب تول کر دو تو) ترازو سیدھی رکھ کر تولا کرو۔ یہ بہت اچھی بات اور انجام کے لحاظ سے بھی بہت بہتر ہے"},{"index":"2065","surah":"17","aya":"36","text":"اور (اے بندے) جس چیز کا تجھے علم نہیں اس کے پیچھے نہ پڑ۔ کہ کان اور آنکھ اور دل ان سب (جوارح) سے ضرور باز پرس ہوگی"},{"index":"2066","surah":"17","aya":"37","text":"اور زمین پر اکڑ کر (اور تن کر) مت چل کہ تو زمین کو پھاڑ تو نہیں ڈالے گا اور نہ لمبا ہو کر پہاڑوں (کی چوٹی) تک پہنچ جائے گا"},{"index":"2067","surah":"17","aya":"38","text":"ان سب (عادتوں) کی برائی تیرے پروردگار کے نزدیک بہت ناپسند ہے"},{"index":"2068","surah":"17","aya":"39","text":"اے پیغمبر یہ ان (ہدایتوں) میں سے ہیں جو خدا نے دانائی کی باتیں تمہاری طرف وحی کی ہیں۔ اور خدا کے ساتھ کوئی معبود نہ بنانا کہ (ایسا کرنے سے) ملامت زدہ اور (درگاہ خدا سے) راندہ بنا کر جہنم میں ڈال دیئے جاؤ گے"},{"index":"2069","surah":"17","aya":"40","text":"(مشرکو!) کیا تمہارے پروردگار نے تم کو لڑکے دیئے اور خود فرشتوں کو بیٹیاں بنایا۔ کچھ شک نہیں کہ (یہ) تم بڑی (نامعقول بات) کہتے ہو"},{"index":"2070","surah":"17","aya":"41","text":"اور ہم نے اس قرآن میں طرح طرح کی باتیں بیان کی ہیں تاکہ لوگ نصیحت پکڑیں گے۔ مگر وہ اس سے اور بدک جاتے ہیں"},{"index":"2071","surah":"17","aya":"42","text":"کہہ دو کہ اگر خدا کے ساتھ اور معبود ہوتے جیسا کہ یہ کہتے ہیں تو وہ ضرور (خدائے) مالک عرش کی طرف (لڑنے بھڑنے کے لئے) رستہ نکالتے"},{"index":"2072","surah":"17","aya":"43","text":"وہ پاک ہے اور جو کچھ یہ بکواس کرتے ہیں اس سے (اس کا رتبہ) بہت عالی ہے"},{"index":"2073","surah":"17","aya":"44","text":"ساتوں آسمان اور زمین اور جو لوگ ان میں ہیں سب اسی کی تسبیح کرتے ہیں۔ اور (مخلوقات میں سے) کوئی چیز نہیں مگر اس کی تعریف کے ساتھ تسبیح کرتی ہے۔ لیکن تم ان کی تسبیح کو نہیں سمجھتے۔ بےشک وہ بردبار (اور) غفار ہے"},{"index":"2074","surah":"17","aya":"45","text":"اور جب قرآن پڑھا کرتے ہو تو ہم تم میں اور ان لوگوں میں جو آخرت پر ایمان نہیں رکھتے حجاب پر حجاب کر دیتے ہیں"},{"index":"2075","surah":"17","aya":"46","text":"اور ان کے دلوں پر پردہ ڈال دیتے ہیں کہ اسے سمجھ نہ سکیں اور ان کے کانوں میں ثقل پیدا کر دیتے ہیں۔ اور جب تم قرآن میں اپنے پروردگار یکتا کا ذکر کرتے ہو تو وہ بدک جاتے اور پیٹھ پھیر کر چل دیتے ہیں"},{"index":"2076","surah":"17","aya":"47","text":"یہ لوگ جب تمہاری طرف کان لگاتے ہیں تو جس نیت سے یہ سنتے ہیں ہم اسے خوب جانتے ہیں اور جب یہ سرگوشیاں کرتے ہیں (یعنی) جب ظالم کہتے ہیں کہ تم ایک ایسے شخص کی پیروی کرتے ہو جس پر جادو کیا گیا ہے"},{"index":"2077","surah":"17","aya":"48","text":"دیکھو انہوں نے کس کس طرح کی تمہارے بارے میں باتیں بنائیں ہیں۔ سو یہ گمراہ ہو رہے ہیں اور رستہ نہیں پاسکتے"},{"index":"2078","surah":"17","aya":"49","text":"اور کہتے ہیں کہ جب ہم (مر کر بوسیدہ) ہڈیوں اور چُور چُور ہوجائیں گے تو کیا ازسرنو پیدا ہو کر اُٹھیں گے"},{"index":"2079","surah":"17","aya":"50","text":"کہہ دو کہ (خواہ تم) پتھر ہوجاؤ یا لوہا"},{"index":"2080","surah":"17","aya":"51","text":"یا کوئی اور چیز جو تمہارے نزدیک (پتھر اور لوہے سے بھی) بڑی (سخت) ہو (جھٹ کہیں گے) کہ (بھلا) ہمیں دوبارہ کون جِلائے گا؟ کہہ دو کہ وہی جس نے تم کو پہلی بار پیدا کیا۔ تو (تعجب سے) تمہارے آگے سرہلائیں گے اور پوچھیں گے کہ ایسا کب ہوگا؟ کہہ دو کہ امید ہے جلد ہوگا"},{"index":"2081","surah":"17","aya":"52","text":"جس دن وہ تمہیں پکارے گا تو تم اس کی تعریف کے ساتھ جواب دو گے اور خیال کرو گے کہ تم (دنیا میں) بہت کم (مدت) رہے"},{"index":"2082","surah":"17","aya":"53","text":"اور میرے بندوں سے کہہ دو کہ (لوگوں سے) ایسی باتیں کہا کریں جو بہت پسندیدہ ہوں۔ کیونکہ شیطان (بری باتوں سے) ان میں فساد ڈلوا دیتا ہے۔ کچھ شک نہیں کہ شیطان انسان کا کھلا دشمن ہے"},{"index":"2083","surah":"17","aya":"54","text":"تمہارا پروردگار تم سے خوب واقف ہے۔ اگر چاہے تو تم پر رحم کرے یا اگر چاہے تو تمہیں عذاب دے۔ اور ہم نے تم کو ان پر داروغہ (بنا کر) نہیں بھیجا"},{"index":"2084","surah":"17","aya":"55","text":"اور جو لوگ آسمانوں اور زمین میں ہیں تمہارا پروردگار ان سے خوب واقف ہے۔ اور ہم نے بعض پیغمبروں کو بعض پر فضیلت بخشی اور داؤد کو زبور عنایت کی"},{"index":"2085","surah":"17","aya":"56","text":"کہو کہ (مشرکو) جن لوگوں کی نسبت تمہیں (معبود ہونے کا) گمان ہے ان کو بلا کر دیکھو۔ وہ تم سے تکلیف کے دور کرنے یا اس کے بدل دینے کا کچھ بھی اختیار نہیں رکھتے"},{"index":"2086","surah":"17","aya":"57","text":"یہ لوگ جن کو (خدا کے سوا) پکارتے ہیں وہ خود اپنے پروردگار کے ہاں ذریعہ (تقرب) تلاش کرتے رہتے ہیں کہ کون ان میں (خدا کا) زیادہ مقرب ہوتا ہے اور اس کی رحمت کے امیدوار رہتے ہیں اور اس کے عذاب سے خوف رکھتے ہیں۔ بےشک تمہارے پروردگار کا عذاب ڈرنے کی چیز ہے"},{"index":"2087","surah":"17","aya":"58","text":"اور (کفر کرنے والوں کی) کوئی بستی نہیں مگر قیامت کے دن سے پہلے ہم اسے ہلاک کردیں گے یا سخت عذاب سے معذب کریں گے۔ یہ کتاب (یعنی تقدیر) میں لکھا جاچکا ہے"},{"index":"2088","surah":"17","aya":"59","text":"اور ہم نے نشانیاں بھیجنی اس لئے موقوف کردیں کہ اگلے لوگوں نے اس کی تکذیب کی تھی۔ اور ہم نے ثمود کو اونٹنی (نبوت صالح کی کھلی) نشانی دی۔ تو انہوں نے اس پر ظلم کیا اور ہم جو نشانیاں بھیجا کرتے ہیں تو ڈرانے کو"},{"index":"2089","surah":"17","aya":"60","text":"جب ہم نے تم سے کہا کہ تمہارا پروردگار لوگوں کو احاطہ کئے ہوئے ہے۔ اور جو نمائش ہم نے تمہیں دکھائی اس کو لوگوں کے لئے آرمائش کیا۔ اور اسی طرح (تھوہر کے) درخت کو جس پر قرآن میں لعنت کی گئی۔ اور ہم انہیں ڈراتے ہیں تو ان کو اس سے بڑی (سخت) سرکشی پیدا ہوتی ہے"},{"index":"2090","surah":"17","aya":"61","text":"اور جب ہم نے فرشتوں سے کہا کہ آدم کو سجدہ کرو تو سب نے سجدہ کیا مگر ابلیس نے نہ کیا۔ بولا کہ بھلا میں ایسے شخص کو سجدہ کرو جس کو تو نے مٹی سے پیدا کیا ہے"},{"index":"2091","surah":"17","aya":"62","text":"(اور از راہ طنز) کہنے لگا کہ دیکھ تو یہی وہ ہے جسے تو نے مجھ پر فضیلت دی ہے۔ اگر تو مجھ کو قیامت کے دن تک مہلت دے تو میں تھوڑے سے شخصوں کے سوا اس کی (تمام) اولاد کی جڑ کاٹتا رہوں گا"},{"index":"2092","surah":"17","aya":"63","text":"خدا نے فرمایا (یہاں سے) چلا جا۔ جو شخص ان میں سے تیری پیروی کرے گا تو تم سب کی جزا جہنم ہے (اور وہ) پوری سزا (ہے)"},{"index":"2093","surah":"17","aya":"64","text":"اور ان میں سے جس کو بہکا سکے اپنی آواز سے بہکاتا رہ۔ اور ان پر اپنے سواروں اور پیاروں کو چڑھا کر لاتا رہ اور ان کے مال اور اولاد میں شریک ہوتا رہ اور ان سے وعدے کرتا رہ۔ اور شیطان جو وعدے ان سے کرتا ہے سب دھوکا ہے"},{"index":"2094","surah":"17","aya":"65","text":"جو میرے (مخلص) بندے ہیں ان پر تیرا کچھ زور نہیں۔ اور (اے پیغمبر) تمہارا پروردگار کارساز کافی ہے"},{"index":"2095","surah":"17","aya":"66","text":"تمہارا پروردگار وہ ہے جو تمہارے لئے دریا میں کشتیاں چلاتا ہے تاکہ تم اس کے فضل سے (روزی) تلاش کرو۔ بےشک وہ تم پر مہربان ہے"},{"index":"2096","surah":"17","aya":"67","text":"اور جب تم کو دریا میں تکلیف پہنچتی ہے (یعنی ڈوبنے کا خوف ہوتا ہے) تو جن کو تم پکارا کرتے ہو سب اس (پروردگار) کے سوا گم ہوجاتے ہیں۔ پھر جب وہ تم کو (ڈوبنے سے) بچا کر خشکی پر لے جاتا ہے تو تم منہ پھیر لیتے ہو اور انسان ہے ہی ناشکرا"},{"index":"2097","surah":"17","aya":"68","text":"کیا تم (اس سے) بےخوف ہو کہ خدا تمہیں خشکی کی طرف (لے جا کر زمین میں) دھنسا دے یا تم پر سنگریزوں کی بھری ہوئی آندھی چلادے۔ پھر تم اپنا کوئی نگہبان نہ پاؤ"},{"index":"2098","surah":"17","aya":"69","text":"یا (اس سے) بےخوف ہو کر تم دوسری دفعہ دریا میں لے جائے پھر تم پر تیز ہوا چلائے اور تمہارے کفر کے سبب تمہیں ڈبو دے۔ پھر تم اس غرق کے سبب اپنے لئے کوئی ہمارا پیچھا کرنے والا نہ پاؤ"},{"index":"2099","surah":"17","aya":"70","text":"اور ہم نے بنی آدم کو عزت بخشی اور ان کو جنگل اور دریا میں سواری دی اور پاکیزہ روزی عطا کی اور اپنی بہت سی مخلوقات پر فضیلت دی"},{"index":"2100","surah":"17","aya":"71","text":"جس دن ہم سب لوگوں کو ان کے پیشواؤں کے ساتھ بلائیں گے۔ تو جن (کے اعمال) کی کتاب ان کے داہنے ہاتھ میں دی جائے گی وہ اپنی کتاب کو (خوش ہو ہو کر) پڑھیں گے اور ان پر دھاگے برابر بھی ظلم نہ ہوگا"},{"index":"2101","surah":"17","aya":"72","text":"اور جو شخص اس (دنیا) میں اندھا ہو وہ آخرت میں بھی اندھا ہوگا۔ اور (نجات کے) رستے سے بہت دور"},{"index":"2102","surah":"17","aya":"73","text":"اور اے پیغمبر جو وحی ہم نے تمہاری طرف بھیجی ہے قریب تھا کہ یہ (کافر) لوگ تم کو اس سے بچلا دیں تاکہ تم اس کے سوا اور باتیں ہماری نسبت بنالو۔ اور اس وقت وہ تم کو دوست بنا لیتے"},{"index":"2103","surah":"17","aya":"74","text":"اور اگر تم کو ثابت قدم نہ رہنے دیتے تو تم کسی قدر ان کی طرف مائل ہونے ہی لگے تھے"},{"index":"2104","surah":"17","aya":"75","text":"اس وقت ہم تم کو زندگی میں (عذاب کا) دونا اور مرنے پر بھی دونا مزا چکھاتے پھر تم ہمارے مقابلے میں کسی کو اپنا مددگار نہ پاتے"},{"index":"2105","surah":"17","aya":"76","text":"اور قریب تھا کہ یہ لوگ تمہیں زمین (مکہ) سے پھسلا دیں تاکہ تمہیں وہاں سے جلاوطن کر دیں۔ اور اس وقت تمہارے پیچھے یہ بھی نہ رہتے مگر کم"},{"index":"2106","surah":"17","aya":"77","text":"جو پیغمبر ہم نے تم سے پہلے بھیجے تھے ان کا (اور ان کے بارے میں ہمارا یہی) طریق رہا ہے اور تم ہمارے طریق میں تغیروتبدل نہ پاؤ گے"},{"index":"2107","surah":"17","aya":"78","text":"(اے محمدﷺ) سورج کے ڈھلنے سے رات کے اندھیرے تک (ظہر، عصر، مغرب، عشا کی) نمازیں اور صبح کو قرآن پڑھا کرو۔ کیوں صبح کے وقت قرآن کا پڑھنا موجب حضور (ملائکہ) ہے"},{"index":"2108","surah":"17","aya":"79","text":"اور بعض حصہ شب میں بیدار ہوا کرو (اور تہجد کی نماز پڑھا کرو) ۔ (یہ شب خیزی) تمہاری لئے (سبب) زیادت ہے (ثواب اور نماز تہجد تم کو نفل) ہے قریب ہے کہ خدا تم کو مقام محمود میں داخل کرے"},{"index":"2109","surah":"17","aya":"80","text":"اور کہو کہ اے پروردگار مجھے (مدینے میں) اچھی طرح داخل کیجیو اور (مکے سے) اچھی طرح نکالیو۔ اور اپنے ہاں سے زور وقوت کو میرا مددگار بنائیو"},{"index":"2110","surah":"17","aya":"81","text":"اور کہہ دو کہ حق آگیا اور باطل نابود ہوگیا۔ بےشک باطل نابود ہونے والا ہے"},{"index":"2111","surah":"17","aya":"82","text":"اور ہم قرآن (کے ذریعے) سے وہ چیز نازل کرتے ہیں جو مومنوں کے لئے شفا اور رحمت ہے اور ظالموں کے حق میں تو اس سے نقصان ہی بڑھتا ہے"},{"index":"2112","surah":"17","aya":"83","text":"اور جب ہم انسان کو نعمت بخشتے ہیں تو ردگرداں ہوجاتا اور پہلو پھیر لیتا ہے۔ اور جب اسے سختی پہنچتی ہے تو ناامید ہوجاتا ہے"},{"index":"2113","surah":"17","aya":"84","text":"کہہ دو کہ ہر شخص اپنے طریق کے مطابق عمل کرتا ہے۔ سو تمہارا پروردگار اس شخص سے خوب واقف ہے جو سب سے زیادہ سیدھے رستے پر ہے"},{"index":"2114","surah":"17","aya":"85","text":"اور تم سے روح کے بارے میں سوال کرتے ہیں۔ کہہ دو کہ وہ میرے پروردگار کی ایک شان ہے اور تم لوگوں کو (بہت ہی) کم علم دیا گیا ہے"},{"index":"2115","surah":"17","aya":"86","text":"اور اگر ہم چاہیں تو جو (کتاب) ہم تمہاری طرف بھیجتے ہیں اسے (دلوں سے) محو کردیں۔ پھر تم اس کے لئے ہمارے مقابلے میں کسی کو مددگار نہ پاؤ"},{"index":"2116","surah":"17","aya":"87","text":"مگر (اس کا قائم رہنا) تمہارے پروردگار کی رحمت ہے۔ کچھ شک نہیں کہ تم پر اس کا بڑا فضل ہے"},{"index":"2117","surah":"17","aya":"88","text":"کہہ دو کہ اگر انسان اور جن اس بات پر مجتمع ہوں کہ اس قرآن جیسا بنا لائیں تو اس جیسا نہ لاسکیں گے اگرچہ وہ ایک دوسرے کو مددگار ہوں"},{"index":"2118","surah":"17","aya":"89","text":"اور ہم نے قرآن میں سب باتیں طرح طرح سے بیان کردی ہیں۔ مگر اکثر لوگوں نے انکار کرنے کے سوا قبول نہ کیا"},{"index":"2119","surah":"17","aya":"90","text":"اور کہنے لگے کہ ہم تم پر ایمان نہیں لائیں گے جب تک کہ (عجیب وغریب باتیں نہ دکھاؤ یعنی یا تو) ہمارے لئے زمین سے چشمہ جاری کردو"},{"index":"2120","surah":"17","aya":"91","text":"یا تمہارا کھجوروں اور انگوروں کا کوئی باغ ہو اور اس کے بیچ میں نہریں بہا نکالو"},{"index":"2121","surah":"17","aya":"92","text":"یا جیسا تم کہا کرتے ہو ہم پر آسمان کے ٹکڑے لا گراؤ یا خدا اور فرشتوں کو (ہمارے) سامنے لاؤ"},{"index":"2122","surah":"17","aya":"93","text":"یا تو تمہارا سونے کا گھر ہو یا تم آسمان پر چڑھ جاؤ۔ اور ہم تمہارے چڑھنے کو بھی نہیں مانیں گے جب تک کہ کوئی کتاب نہ لاؤ جسے ہم پڑھ بھی لیں۔ کہہ دو کہ میرا پروردگار پاک ہے میں تو صرف ایک پیغام پہنچانے والا انسان ہوں"},{"index":"2123","surah":"17","aya":"94","text":"اور جب لوگوں کے پاس ہدایت آگئی تو ان کو ایمان لانے سے اس کے سوا کوئی چیز مانع نہ ہوئی کہ کہنے لگے کہ کیا خدا نے آدمی کو پیغمبر کرکے بھیجا ہے"},{"index":"2124","surah":"17","aya":"95","text":"کہہ دو کہ اگر زمین میں فرشتے ہوتے (کہ اس میں) چلتے پھرتے (اور) آرام کرتے (یعنی بستے) تو ہم اُن کے پاس فرشتے کو پیغمبر بنا کر بھیجتے"},{"index":"2125","surah":"17","aya":"96","text":"کہہ دو کہ میرے اور تمہارے درمیان خدا ہی گواہ کافی ہے۔ وہی اپنے بندوں سے خبردار (اور ان کو) دیکھنے والا ہے"},{"index":"2126","surah":"17","aya":"97","text":"اور جس شخص کو خدا ہدایت دے وہی ہدایت یاب ہے۔ اور جن کو گمراہ کرے تو تم خدا کے سوا اُن کے رفیق نہیں پاؤ گے۔ اور ہم اُن کو قیامت کے دن اوندھے منہ اندھے گونگے اور بہرے (بنا کر) اٹھائیں گے۔ اور ان کا ٹھکانہ دوزخ ہے۔ جب (اس کی آگ) بجھنے کو ہوگی تو ہم ان کو (عذاب دینے کے لئے) اور بھڑکا دیں گے"},{"index":"2127","surah":"17","aya":"98","text":"یہ ان کی سزا ہے اس لئے کہ وہ ہماری آیتوں سے کفر کرتے تھے اور کہتے تھے کہ جب ہم (مر کر بوسیدہ) ہڈیاں اور ریزہ ریزہ ہوجائیں گے تو کیا ازسرنو پیدا کئے جائیں گے"},{"index":"2128","surah":"17","aya":"99","text":"کیا انہوں نے نہیں دیکھا کہ خدا جس نے آسمانوں اور زمین کو پیدا کیا ہے اس بات پر قادر ہے کہ ان جیسے (لوگ) پیدا کردے۔ اور اس نے ان کے لئے ایک وقت مقرر کر دیا ہے جس میں کچھ بھی شک نہیں۔ تو ظالموں نے انکار کرنے کے سوا (اسے) قبول نہ کیا"},{"index":"2129","surah":"17","aya":"100","text":"کہہ دو کہ اگر میرے پروردگار کی رحمت کے خزانے تمہارے ہاتھ میں ہوتے تو تم خرچ ہوجانے کے خوف سے (ان کو) بند رکھتے۔ اور انسان دل کا بہت تنگ ہے"},{"index":"2130","surah":"17","aya":"101","text":"اور ہم نے موسیٰ کو نو کھلی نشانیاں دیں تو بنی اسرائیل سے دریافت کرلو کہ جب وہ ان کے پاس آئے تو فرعون نے ان سے کہا کہ موسیٰ میں خیال کرتا ہوں کہ تم پر جادو کیا گیا ہے"},{"index":"2131","surah":"17","aya":"102","text":"انہوں نے کہا کہ تم یہ جانتے ہو کہ آسمانوں اور زمین کے پروردگار کے سوا ان کو کسی نے نازل نہیں کیا۔ (اور وہ بھی تم لوگوں کے) سمجھانے کو۔ اور اے فرعون میں خیال کرتا ہوں کہ تم ہلاک ہوجاؤ گے"},{"index":"2132","surah":"17","aya":"103","text":"تو اس نے چاہا کہ ان کو سر زمین (مصر) سے نکال دے تو ہم نے اس کو اور جو اس کے ساتھ تھے سب کو ڈبو دیا"},{"index":"2133","surah":"17","aya":"104","text":"اور اس کے بعد بنی اسرائیل سے کہا کہ تم اس ملک میں رہو سہو۔ پھر جب آخرت کا وعدہ آجائے گا تو ہم تم سب کو جمع کرکے لے آئیں گے"},{"index":"2134","surah":"17","aya":"105","text":"اور ہم نے اس قرآن کو سچائی کے ساتھ نازل کیا ہے اور وہ سچائی کے ساتھ نازل ہوا اور (اے محمدﷺ) ہم نے تم کو صرف خوشخبری دینے والا اور ڈر سنانے والا بنا کر بھیجا ہے"},{"index":"2135","surah":"17","aya":"106","text":"اور ہم نے قرآن کو جزو جزو کرکے نازل کیا ہے تاکہ تم لوگوں کو ٹھیر ٹھیر کر پڑھ کر سناؤ اور ہم نے اس کو آہستہ آہستہ اُتارا ہے"},{"index":"2136","surah":"17","aya":"107","text":"کہہ دو کہ تم اس پر ایمان لاؤ یا نہ لاؤ (یہ فی نفسہ حق ہے) جن لوگوں کو اس سے پہلے علم (کتاب) دیا ہے۔ جب وہ ان کو پڑھ کر سنایا جاتا ہے تو وہ تھوڑیوں کے بل سجدے میں گر پڑتے ہیں"},{"index":"2137","surah":"17","aya":"108","text":"اور کہتے ہیں کہ ہمارا پروردگار پاک ہے بےشک ہمارے پروردگار کا وعدہ پورا ہو کر رہا"},{"index":"2138","surah":"17","aya":"109","text":"اور وہ تھوڑیوں کے بل گر پڑتے ہیں (اور) روتے جاتے ہیں اور اس سے ان کو اور زیادہ عاجزی پیدا ہوتی ہے"},{"index":"2139","surah":"17","aya":"110","text":"کہہ دو کہ تم (خدا کو) الله (کے نام سے) پکارو یا رحمٰن (کے نام سے) جس نام سے پکارو اس کے سب اچھے نام ہیں۔ اور نماز نہ بلند آواز سے پڑھو اور نہ آہستہ بلکہ اس کے بیچ کا طریقہ اختیار کرو"},{"index":"2140","surah":"17","aya":"111","text":"اور کہو کہ سب تعریف خدا ہی کو ہے جس نے نہ تو کسی کو بیٹا بنایا ہے اور نہ اس کی بادشاہی میں کوئی شریک ہے اور نہ اس وجہ سے کہ وہ عاجز وناتواں ہے کوئی اس کا مددگار ہے اور اس کو بڑا جان کر اس کی بڑائی کرتے رہو"}]}