{"data":[{"index":"2349","surah":"20","aya":"1","text":"طہٰ"},{"index":"2350","surah":"20","aya":"2","text":"(اے محمدﷺ) ہم نے تم پر قرآن اس لئے نازل نہیں کیا کہ تم مشقت میں پڑ جاؤ"},{"index":"2351","surah":"20","aya":"3","text":"بلکہ اس شخص کو نصیحت دینے کے لئے (نازل کیا ہے) جو خوف رکھتا ہے"},{"index":"2352","surah":"20","aya":"4","text":"یہ اس (ذات برتر) کا اتارا ہوا ہے جس نے زمین اور اونچے اونچے آسمان بنائے"},{"index":"2353","surah":"20","aya":"5","text":"(یعنی خدائے) رحمٰن جس نےعرش پر قرار پکڑا"},{"index":"2354","surah":"20","aya":"6","text":"جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے اور جو کچھ ان دونوں کے بیچ میں ہے اور جو کچھ (زمین کی) مٹی کے نیچے ہے سب اسی کا ہے"},{"index":"2355","surah":"20","aya":"7","text":"اور اگر تم پکار کر بات کہو تو وہ تو چھپے بھید اور نہایت پوشیدہ بات تک کو جانتا ہے"},{"index":"2356","surah":"20","aya":"8","text":"(وہ معبود برحق ہے کہ) اس کے سوا کوئی معبود نہیں ہے۔ اس کے (سب) نام اچھے ہیں"},{"index":"2357","surah":"20","aya":"9","text":"اور کیا تمہیں موسیٰ (کے حال) کی خبر ملی ہے"},{"index":"2358","surah":"20","aya":"10","text":"جب انہوں نے آگ دیکھی تو اپنے گھر والوں سے کہا کہ تم (یہاں) ٹھہرو میں نے آگ دیکھی ہے (میں وہاں جاتا ہوں) شاید اس میں سے میں تمہارے پاس انگاری لاؤں یا آگ (کے مقام) کا رستہ معلوم کرسکوں"},{"index":"2359","surah":"20","aya":"11","text":"جب وہاں پہنچے تو آواز آئی کہ موسیٰ"},{"index":"2360","surah":"20","aya":"12","text":"میں تو تمہارا پروردگار ہوں تو اپنی جوتیاں اتار دو۔ تم (یہاں) پاک میدان (یعنی) طویٰ میں ہو"},{"index":"2361","surah":"20","aya":"13","text":"اور میں نے تم کو انتخاب کرلیا ہے تو جو حکم دیا جائے اسے سنو"},{"index":"2362","surah":"20","aya":"14","text":"بےشک میں ہی خدا ہوں۔ میرے سوا کوئی معبود نہیں تو میری عبادت کرو اور میری یاد کے لئے نماز پڑھا کرو"},{"index":"2363","surah":"20","aya":"15","text":"قیامت یقیناً آنے والی ہے۔ میں چاہتا ہوں کہ اس (کے وقت) کو پوشیدہ رکھوں تاکہ ہر شخص جو کوشش کرے اس کا بدلا پائے"},{"index":"2364","surah":"20","aya":"16","text":"تو جو شخص اس پر ایمان نہیں رکھتا اور اپنی خواہش کے پیچھے چلتا ہے (کہیں) تم کو اس (کے یقین) سے روک نہ دے تو (اس صورت میں) تم ہلاک ہوجاؤ"},{"index":"2365","surah":"20","aya":"17","text":"اور موسی یہ تمہارے داہنے ہاتھ میں کیا ہے"},{"index":"2366","surah":"20","aya":"18","text":"انہوں نے کہا یہ میری لاٹھی ہے۔ اس پر میں سہارا لگاتا ہوں اور اس سے اپنی بکریوں کے لئے پتے جھاڑتا ہوں اور اس میں میرے لئے اور بھی کئی فائدے ہیں"},{"index":"2367","surah":"20","aya":"19","text":"فرمایا کہ موسیٰ اسے ڈال دو"},{"index":"2368","surah":"20","aya":"20","text":"تو انہوں نے اس کو ڈال دیا اور وہ ناگہاں سانپ بن کر دوڑنے لگا"},{"index":"2369","surah":"20","aya":"21","text":"خدا نے فرمایا کہ اسے پکڑ لو اور ڈرنا مت۔ ہم اس کو ابھی اس کی پہلی حالت پر لوٹا دیں گے"},{"index":"2370","surah":"20","aya":"22","text":"اور اپنا ہاتھ اپنی بغل سے لگالو وہ کسی عیب (وبیماری) کے بغیر سفید (چمکتا دمکتا) نکلے گا۔ (یہ) دوسری نشانی (ہے)"},{"index":"2371","surah":"20","aya":"23","text":"تاکہ ہم تمہیں اپنے نشانات عظیم دکھائیں"},{"index":"2372","surah":"20","aya":"24","text":"تم فرعون کے پاس جاؤ (کہ) وہ سرکش ہو رہا ہے"},{"index":"2373","surah":"20","aya":"25","text":"کہا میرے پروردگار (اس کام کے لئے) میرا سینہ کھول دے"},{"index":"2374","surah":"20","aya":"26","text":"اور میرا کام آسان کردے"},{"index":"2375","surah":"20","aya":"27","text":"اور میری زبان کی گرہ کھول دے"},{"index":"2376","surah":"20","aya":"28","text":"تاکہ وہ بات سمجھ لیں"},{"index":"2377","surah":"20","aya":"29","text":"اور میرے گھر والوں میں سے (ایک کو) میرا وزیر (یعنی مددگار) مقرر فرما"},{"index":"2378","surah":"20","aya":"30","text":"(یعنی) میرے بھائی ہارون کو"},{"index":"2379","surah":"20","aya":"31","text":"اس سے میری قوت کو مضبوط فرما"},{"index":"2380","surah":"20","aya":"32","text":"اور اسے میرے کام میں شریک کر"},{"index":"2381","surah":"20","aya":"33","text":"تاکہ ہم تیری بہت سی تسبیح کریں"},{"index":"2382","surah":"20","aya":"34","text":"اور تجھے کثرت سے یاد کریں"},{"index":"2383","surah":"20","aya":"35","text":"تو ہم کو (ہر حال میں) دیکھ رہا ہے"},{"index":"2384","surah":"20","aya":"36","text":"فرمایا موسیٰ تمہاری دعا قبول کی گئی"},{"index":"2385","surah":"20","aya":"37","text":"اور ہم نے تم پر ایک بار اور بھی احسان کیا تھا"},{"index":"2386","surah":"20","aya":"38","text":"جب ہم نے تمہاری والدہ کو الہام کیا تھا جو تمہیں بتایا جاتا ہے"},{"index":"2387","surah":"20","aya":"39","text":"(وہ یہ تھا) کہ اسے (یعنی موسیٰ کو) صندوق میں رکھو پھر اس (صندوق) کو دریا میں ڈال دو تو دریا اسے کنارے پر ڈال دے گا (اور) میرا اور اس کا دشمن اسے اٹھا لے گا۔ اور (موسیٰ) میں نے تم پر اپنی طرف سے محبت ڈال دی ہے (اس لئے کہ تم پر مہربانی کی جائے) اور اس لئے کہ تم میرے سامنے پرورش پاؤ"},{"index":"2388","surah":"20","aya":"40","text":"جب تمہاری بہن (فرعون کے ہاں) گئی اور کہنے لگی کہ میں تمہیں ایسا شخص بتاؤں جو اس کو پالے۔ تو (اس طریق سے) ہم نے تم کو تمہاری ماں کے پاس پہنچا دیا تاکہ ان کی آنکھیں ٹھنڈی ہوں اور وہ رنج نہ کریں۔ اور تم نے ایک شخص کو مار ڈالا تو ہم نے تم کو غم سے مخلصی دی اور ہم نے تمہاری (کئی بار) آزمائش کی۔ پھر تم کئی سال اہل مدین میں ٹھہرے رہے۔ پھر اے موسیٰ تم (قابلیت رسالت کے) اندازے پر آ پہنچے"},{"index":"2389","surah":"20","aya":"41","text":"اور میں نے تم کو اپنے (کام کے) لئے بنایا ہے"},{"index":"2390","surah":"20","aya":"42","text":"تو تم اور تمہارا بھائی دونوں ہماری نشانیاں لے کر جاؤ اور میری یاد میں سستی نہ کرنا"},{"index":"2391","surah":"20","aya":"43","text":"دونوں فرعون کے پاس جاؤ وہ سرکش ہو رہا ہے"},{"index":"2392","surah":"20","aya":"44","text":"اور اس سے نرمی سے بات کرنا شاید وہ غور کرے یا ڈر جائے"},{"index":"2393","surah":"20","aya":"45","text":"دونوں کہنے لگے کہ ہمارے پروردگار ہمیں خوف ہے کہ ہم پر تعدی کرنے لگے یا زیادہ سرکش ہوجائے"},{"index":"2394","surah":"20","aya":"46","text":"خدا نے فرمایا کہ ڈرو مت میں تمہارے ساتھ ہوں (اور) سنتا اور دیکھتا ہوں"},{"index":"2395","surah":"20","aya":"47","text":"(اچھا) تو اس کے پاس جاؤ اور کہو کہ ہم آپ کے پروردگار کے بھیجے ہوئے ہیں تو بنی اسرائیل کو ہمارے ساتھ جانے کی اجازت دیجیئے۔ اور انہیں عذاب نہ کیجیئے۔ ہم آپ کے پاس آپ کے پروردگار کی طرف سے نشانی لے کر آئے ہیں۔ اور جو ہدایت کی بات مانے اس کو سلامتی ہو"},{"index":"2396","surah":"20","aya":"48","text":"ہماری طرف یہ وحی آئی ہے کہ جو جھٹلائے اور منہ پھیرے اس کے لئے عذاب (تیار) ہے"},{"index":"2397","surah":"20","aya":"49","text":"(غرض موسیٰ اور ہارون فرعون کے پاس گئے) اس نے کہا کہ موسیٰ تمہارا پروردگار کون ہے؟"},{"index":"2398","surah":"20","aya":"50","text":"کہا کہ ہمارا پروردگار وہ ہے جس نے ہر چیز کو اس کی شکل وصورت بخشی پھر راہ دکھائی"},{"index":"2399","surah":"20","aya":"51","text":"کہا تو پہلی جماعتوں کا کیا حال؟"},{"index":"2400","surah":"20","aya":"52","text":"کہا کہ ان کا علم میرے پروردگار کو ہے (جو) کتاب میں (لکھا ہوا ہے) ۔ میرا پروردگار نہ چوکتا ہے نہ بھولتا ہے"},{"index":"2401","surah":"20","aya":"53","text":"وہ (وہی تو ہے) جس نے تم لوگوں کے لئے زمین کو فرش بنایا اور اس میں تمہارے لئے رستے جاری کئے اور آسمان سے پانی برسایا۔ پھر اس سے انواع واقسام کی مختلف روئیدگیاں پیدا کیں"},{"index":"2402","surah":"20","aya":"54","text":"کہ (خود بھی) کھاؤ اور اپنے چارپایوں کو بھی چراؤ۔ بےشک ان (باتوں) میں عقل والوں کے لئے (بہت سی) نشانیاں ہیں"},{"index":"2403","surah":"20","aya":"55","text":"اسی (زمین) سے ہم تم کو پیدا کیا اور اسی میں تمہیں لوٹائیں گے اور اسی سے دوسری دفعہ نکالیں گے"},{"index":"2404","surah":"20","aya":"56","text":"اور ہم نے فرعون کو اپنی سب نشانیاں دکھائیں مگر وہ تکذیب وانکار ہی کرتا رہا"},{"index":"2405","surah":"20","aya":"57","text":"کہنے لگا کہ موسیٰ تم ہمارے پاس اس لئے آئے ہو کہ اپنے جادو (کے زور) سے ہمیں ہمارے ملک سے نکال دو"},{"index":"2406","surah":"20","aya":"58","text":"تو ہم بھی تمہارے مقابل ایسا ہی جادو لائیں گے تو ہمارے اور اپنے درمیان ایک وقت مقرر کر لو کہ نہ تو ہم اس کے خلاف کریں اور نہ تم (اور یہ مقابلہ) ایک ہموار میدان میں (ہوگا)"},{"index":"2407","surah":"20","aya":"59","text":"موسیٰ نے کہا آپ کے لئے (مقابلے کا) دن نو روز (مقرر کیا جاتا ہے) اور یہ کہ لوگ اس دن چاشت کے وقت اکھٹے ہوجائیں"},{"index":"2408","surah":"20","aya":"60","text":"تو فرعون لوٹ گیا اور اپنے سامان جمع کرکے پھر آیا"},{"index":"2409","surah":"20","aya":"61","text":"موسیٰ نے ان (جادوگروں) سے کہا کہ ہائے تمہاری کمبختی۔ خدا پر جھوٹ افتراء نہ کرو کہ وہ تمہیں عذاب سے فنا کردے گا اور جس نے افتراء کیا وہ نامراد رہا"},{"index":"2410","surah":"20","aya":"62","text":"تو وہ باہم اپنے معاملے میں جھگڑانے اور چپکے چپکے سرگوشی کرنے لگے"},{"index":"2411","surah":"20","aya":"63","text":"کہنے لگے یہ دونوں جادوگر ہیں چاہتے ہیں کہ اپنے جادو (کے زور) سے تم کو تمہارے ملک سے نکل دیں اور تمہارے شائستہ مذہب کو نابود کردیں"},{"index":"2412","surah":"20","aya":"64","text":"تو تم (جادو کا) سامان اکھٹا کرلو اور پھر قطار باندھ کر آؤ۔ آج جو غالب رہا وہی کامیاب ہوا"},{"index":"2413","surah":"20","aya":"65","text":"بولے کہ موسیٰ یا تم (اپنی چیز) ڈالو یا ہم (اپنی چیزیں) پہلے ڈالتے ہیں"},{"index":"2414","surah":"20","aya":"66","text":"موسیٰ نے کہا نہیں تم ہی ڈالو۔ (جب انہوں نے چیزیں ڈالیں) تو ناگہاں ان کی رسیاں اور لاٹھیاں موسی کے خیال میں ایسی آنے لگیں کہ وہ (میدان) میں ادھر اُدھر دوڑ رہی ہیں"},{"index":"2415","surah":"20","aya":"67","text":"(اُس وقت) موسیٰ نے اپنے دل میں خوف معلوم کیا"},{"index":"2416","surah":"20","aya":"68","text":"ہم نے کہا خوف نہ کرو بلاشبہ تم ہی غالب ہو"},{"index":"2417","surah":"20","aya":"69","text":"اور جو چیز (یعنی لاٹھی) تمہارے داہنے ہاتھ میں ہے اسے ڈال دو کہ جو کچھ انہوں نے بنایا ہے اس کو نگل جائے گی۔ جو کچھ انہوں نے بنایا ہے (یہ تو) جادوگروں کے ہتھکنڈے ہیں اور جادوگر جہاں جائے فلاح نہیں پائے گا"},{"index":"2418","surah":"20","aya":"70","text":"(القصہ یوں ہی ہوا) تو جادوگر سجدے میں گر پڑے (اور) کہنے لگے کہ ہم موسیٰ اور ہارون کے پروردگار پر ایمان لائے"},{"index":"2419","surah":"20","aya":"71","text":"(فرعون) بولا کہ پیشتر اس کے میں تمہیں اجازت دوں تم اس پر ایمان لے آئے۔ بےشک وہ تمہارا بڑا (یعنی استاد) ہے جس نے تم کو جادو سکھایا ہے۔ سو میں تمہارے ہاتھ اور پاؤں (جانب) خلاف سے کٹوا دوں گا اور کھجور کے تنوں پر سولی چڑھوا دوں گا (اس وقت) تم کو معلوم ہوگا کہ ہم میں سے کس کا عذاب زیادہ سخت اور دیر تک رہنے والا ہے"},{"index":"2420","surah":"20","aya":"72","text":"انہوں نے کہا جو دلائل ہمارے پاس آگئے ہیں ان پر اور جس نے ہم کو پیدا ہے اس پر ہم آپ کو ہرگز ترجیح نہیں دیں گے تو آپ کو جو حکم دینا ہو دے دیجیئے۔ اور آپ (جو) حکم دے سکتے ہیں وہ صرف اسی دنیا کی زندگی میں (دے سکتے ہیں)"},{"index":"2421","surah":"20","aya":"73","text":"ہم اپنے پروردگار پر ایمان لے آئے تاکہ وہ ہمارے گناہوں کو معاف کرے اور (اسے بھی) جو آپ نے ہم سے زبردستی جادو کرایا۔ اور خدا بہتر اور باقی رہنے والا ہے"},{"index":"2422","surah":"20","aya":"74","text":"جو شخص اپنے پروردگار کے پاس گنہگار ہو کر آئے گا تو اس کے لئے جہنم ہے۔ جس میں نہ مرے گا نہ جیئے گا"},{"index":"2423","surah":"20","aya":"75","text":"اور جو اس کے روبرو ایماندار ہو کر آئے گا اور عمل بھی نیک کئے ہوں گے تو ایسے لوگوں کے لئے اونچے اونچے درجے ہیں"},{"index":"2424","surah":"20","aya":"76","text":"(یعنی) ہمیشہ رہنے کے باغ جن کے نیچے نہریں بہہ رہی ہیں۔ ہمیشہ ان میں رہیں گے۔ اور یہ اس شخص کا بدلہ ہے جو پاک ہوا"},{"index":"2425","surah":"20","aya":"77","text":"اور ہم نے موسیٰ کی طرف وحی بھیجی کہ ہمارے بندوں کو راتوں رات نکال لے جاؤ پھر ان کے لئے دریا میں (لاٹھی مار کر) خشک رستہ بنا دو پھر تم کو نہ تو (فرعون کے) آپکڑنے کا خوف ہوگا اور نہ (غرق ہونے کا) ڈر"},{"index":"2426","surah":"20","aya":"78","text":"پھر فرعون نے اپنے لشکر کے ساتھ ان کا تعاقب کیا تو دریا (کی موجوں) نے ان پر چڑھ کر انہیں ڈھانک لیا (یعنی ڈبو دیا)"},{"index":"2427","surah":"20","aya":"79","text":"اور فرعون نے اپنی قوم کو گمراہ کردیا اور سیدھے رستے پر نہ ڈالا"},{"index":"2428","surah":"20","aya":"80","text":"اے آل یعقوب ہم نے تم کو تمہارے دشمن سے نجات دی اور تورات دینے کے لئے تم سے کوہ طور کی داہنی طرف مقرر کی اور تم پر من اور سلویٰ نازل کیا"},{"index":"2429","surah":"20","aya":"81","text":"(اور حکم دیا کہ) جو پاکیزہ چیزیں ہم نے تم کو دی ہیں ان کو کھاؤ۔ اور اس میں حد سے نہ نکلنا۔ ورنہ تم پر میرا غضب نازل ہوگا۔ اور جس پر میرا غضب نازل ہوا وہ ہلاک ہوگیا"},{"index":"2430","surah":"20","aya":"82","text":"اور جو توبہ کرے اور ایمان لائے اور عمل نیک کرے پھر سیدھے رستے چلے اس کو میں بخش دینے والا ہوں"},{"index":"2431","surah":"20","aya":"83","text":"اور اے موسیٰ تم نے اپنی قوم سے (آگے چلے آنے میں) کیوں جلدی کی"},{"index":"2432","surah":"20","aya":"84","text":"کہا وہ میرے پیچھے (آ رہے) ہیں اور اے پروردگار میں نے تیری طرف (آنے کی) جلدی اس لئے کی کہ تو خوش ہو"},{"index":"2433","surah":"20","aya":"85","text":"فرمایا کہ ہم نے تمہاری قوم کو تمہارے بعد آزمائش میں ڈال دیا ہے اور سامری نے ان کو بہکا دیا ہے"},{"index":"2434","surah":"20","aya":"86","text":"اور موسیٰ غصّے اور غم کی حالت میں اپنی قوم کے پاس واپس آئے (اور) کہنے لگے کہ اے قوم کیا تمہارے پروردگار نے تم سے ایک اچھا وعدہ نہیں کیا تھا؟ کیا (میری جدائی کی) مدت تمہیں دراز (معلوم) ہوئی یا تم نے چاہا کہ تم پر تمہارے پروردگار کی طرف سے غضب نازل ہو۔ اور (اس لئے) تم نے مجھ سے جو وعدہ کیا تھا (اس کے) خلاف کیا"},{"index":"2435","surah":"20","aya":"87","text":"وہ کہنے لگے کہ ہم نے اپنے اختیار سے تم سے وعدہ خلاف نہیں کیا۔ بلکہ ہم لوگوں کے زیوروں کا بوجھ اٹھائے ہوئے تھے۔ پھر ہم نے اس کو (آگ میں) ڈال دیا اور اسی طرح سامری نے ڈال دیا"},{"index":"2436","surah":"20","aya":"88","text":"تو اس نے ان کے لئے ایک بچھڑا بنا دیا (یعنی اس کا) قالب جس کی آواز گائے کی سی تھی۔ تو لوگ کہنے لگے کہ یہی تمہارا معبود ہے اور موسیٰ کا بھی معبود ہے۔ مگر وہ بھول گئے ہیں"},{"index":"2437","surah":"20","aya":"89","text":"کیا یہ لوگ نہیں دیکھتے کہ وہ ان کی کسی بات کا جواب نہیں دیتا۔ اور نہ ان کے نقصان اور نفع کا کچھ اختیار رکھتا ہے"},{"index":"2438","surah":"20","aya":"90","text":"اور ہارون نے ان سے پہلے ہی کہہ دیا تھا کہ لوگو اس سے صرف تمہاری آزمائش کی گئی ہے۔ اور تمہارا پروردگار تو خدا ہے تو میری پیروی کرو اور میرا کہا مانو"},{"index":"2439","surah":"20","aya":"91","text":"وہ کہنے لگے کہ جب تک موسیٰ ہمارے پاس واپس نہ آئیں ہم تو اس کی پوجا پر قائم رہیں گے"},{"index":"2440","surah":"20","aya":"92","text":"(پھر موسیٰ نے ہارون سے) کہا کہ ہارون جب تم نے ان کو دیکھا تھا کہ گمراہ ہو رہے ہیں تو تم کو کس چیز نے روکا"},{"index":"2441","surah":"20","aya":"93","text":"(یعنی) اس بات سے کہ تم میرے پیچھے چلے آؤ۔ بھلا تم نے میرے حکم کے خلاف (کیوں) کیا؟"},{"index":"2442","surah":"20","aya":"94","text":"کہنے لگے کہ بھائی میری ڈاڑھی اور سر (کے بالوں) کو نہ پکڑیئے۔ میں تو اس سے ڈرا کہ آپ یہ نہ کہیں کہ تم نے بنی اسرائیل میں تفرقہ ڈال دیا اور میری بات کو ملحوظ نہ رکھا"},{"index":"2443","surah":"20","aya":"95","text":"پھر (سامری سے) کہنے لگے کہ سامری تیرا کیا حال ہے؟"},{"index":"2444","surah":"20","aya":"96","text":"اس نے کہا کہ میں نے ایسی چیز دیکھی جو اوروں نے نہیں دیکھی تو میں نے فرشتے کے نقش پا سے (مٹی کی) ایک مٹھی بھر لی۔ پھر اس کو (بچھڑے کے قالب میں) ڈال دیا اور مجھے میرے جی نے (اس کام کو) اچھا بتایا"},{"index":"2445","surah":"20","aya":"97","text":"(موسیٰ نے) کہا جا تجھ کو دنیا کی زندگی میں یہ (سزا) ہے کہ کہتا رہے کہ مجھ کو ہاتھ نہ لگانا اور تیرے لئے ایک اور وعدہ ہے (یعنی عذاب کا) جو تجھ سے ٹل نہ سکے گا اور جس معبود (کی پوجا) پر تو (قائم و) معتکف تھا اس کو دیکھ۔ ہم اسے جلادیں گے پھر اس (کی راکھ) کو اُڑا کر دریا میں بکھیر دیں گے"},{"index":"2446","surah":"20","aya":"98","text":"تمہارا معبود خدا ہی ہے جس کے سوا کوئی معبود نہیں۔ اس کا علم ہر چیز پر محیط ہے"},{"index":"2447","surah":"20","aya":"99","text":"اس طرح پر ہم تم سے وہ حالات بیان کرتے ہیں جو گذر چکے ہیں۔ اور ہم نے تمہیں اپنے پاس سے نصیحت (کی کتاب) عطا فرمائی ہے"},{"index":"2448","surah":"20","aya":"100","text":"جو شخص اس سے منہ پھیرے گا وہ قیامت کے دن (گناہ کا) بوجھ اُٹھائے گا"},{"index":"2449","surah":"20","aya":"101","text":"(ایسے لوگ) ہمیشہ اس (عذاب) میں (مبتلا) رہیں گے اور یہ بوجھ قیامت کے روز ان کے لئے برا ہے"},{"index":"2450","surah":"20","aya":"102","text":"جس روز صور پھونکا جائے گا اور ہم گنہگاروں کو اکھٹا کریں گے اور ان کی آنکھیں نیلی نیلی ہوں گی"},{"index":"2451","surah":"20","aya":"103","text":"(تو) وہ آپس میں آہستہ آہستہ کہیں گے کہ تم (دنیا میں) صرف دس ہی دن رہے ہو"},{"index":"2452","surah":"20","aya":"104","text":"جو باتیں یہ کریں گے ہم خوب جانتے ہیں۔ اس وقت ان میں سب سے اچھی راہ والا (یعنی عاقل وہوشمند) کہے گا کہ (نہیں بلکہ) صرف ایک ہی روز ٹھہرے ہو"},{"index":"2453","surah":"20","aya":"105","text":"اور تم سے پہاڑوں کے بارے میں دریافت کرتے ہیں۔ کہہ دو کہ خدا ان کو اُڑا کر بکھیر دے گا"},{"index":"2454","surah":"20","aya":"106","text":"اور زمین کو ہموار میدان کر چھوڑے گا"},{"index":"2455","surah":"20","aya":"107","text":"جس میں نہ تم کجی (اور پستی) دیکھو گے نہ ٹیلا (اور بلندی)"},{"index":"2456","surah":"20","aya":"108","text":"اس روز لوگ ایک پکارنے والے کے پیچھے چلیں گے اور اس کی پیروی سے انحراف نہ کرسکیں گے اور خدا کے سامنے آوازیں پست ہوجائیں گی تو تم آواز خفی کے سوا کوئی آواز نہ سنو گے"},{"index":"2457","surah":"20","aya":"109","text":"اس روز (کسی کی) سفارش کچھ فائدہ نہ دے گی مگر اس شخص کی جسے خدا اجازت دے اور اس کی بات کو پسند فرمائے"},{"index":"2458","surah":"20","aya":"110","text":"جو کچھ ان کے آگے ہے اور کچھ ان کے پیچھے ہے وہ اس کو جانتا ہے اور وہ (اپنے) علم سے خدا (کے علم) پر احاطہ نہیں کرسکتے"},{"index":"2459","surah":"20","aya":"111","text":"اور اس زندہ و قائم کے رو برو منہ نیچے ہوجائیں گے۔ اور جس نے ظلم کا بوجھ اٹھایا وہ نامراد رہا"},{"index":"2460","surah":"20","aya":"112","text":"اور جو نیک کام کرے گا اور مومن بھی ہوگا تو اس کو نہ ظلم کا خوف ہوگا اور نہ نقصان کا"},{"index":"2461","surah":"20","aya":"113","text":"اور ہم نے اس کو اسی طرح کا قرآن عربی نازل کیا ہے اور اس میں طرح طرح کے ڈراوے بیان کردیئے ہیں تاکہ لوگ پرہیزگار بنیں یا خدا ان کے لئے نصیحت پیدا کردے"},{"index":"2462","surah":"20","aya":"114","text":"تو خدا جو سچا بادشاہ ہے عالی قدر ہے۔ اور قرآن کی وحی جو تمہاری طرف بھیجی جاتی ہے اس کے پورا ہونے سے پہلے قرآن کے (پڑھنے کے) لئے جلدی نہ کیا کرو اور دعا کرو کہ میرے پروردگار مجھے اور زیادہ علم دے"},{"index":"2463","surah":"20","aya":"115","text":"اور ہم نے پہلے آدم سے عہد لیا تھا مگر وہ (اسے) بھول گئے اور ہم نے ان میں صبر وثبات نہ دیکھا"},{"index":"2464","surah":"20","aya":"116","text":"اور جب ہم نے فرشتوں سے کہا کہ آدم کے آگے سجدہ کرو تو سب سجدے میں گر پڑے مگر ابلیس نے انکار کیا"},{"index":"2465","surah":"20","aya":"117","text":"ہم نے فرمایا کہ آدم یہ تمہارا اور تمہاری بیوی کا دشمن ہے تو یہ کہیں تم دونوں کو بہشت سے نکلوا نہ دے۔ پھر تم تکلیف میں پڑجاؤ"},{"index":"2466","surah":"20","aya":"118","text":"یہاں تم کو یہ (آسائش) ہوگی کہ نہ بھوکے رہو نہ ننگے"},{"index":"2467","surah":"20","aya":"119","text":"اور یہ کہ نہ پیاسے رہو اور نہ دھوپ کھاؤ"},{"index":"2468","surah":"20","aya":"120","text":"تو شیطان نے ان کے دل میں وسوسہ ڈالا۔ (اور) کہا کہ آدم بھلا میں تم کو (ایسا) درخت بتاؤں (جو) ہمیشہ کی زندگی کا (ثمرہ دے) اور (ایسی) بادشاہت کہ کبھی زائل نہ ہو"},{"index":"2469","surah":"20","aya":"121","text":"تو دونوں نے اس درخت کا پھل کھا لیا تو ان پر ان کی شرمگاہیں ظاہر ہوگئیں اور وہ اپنے (بدنوں) پر بہشت کے پتّے چپکانے لگے۔ اور آدم نے اپنے پروردگار کے حکم خلاف کیا تو (وہ اپنے مطلوب سے) بےراہ ہو گئے"},{"index":"2470","surah":"20","aya":"122","text":"پھر ان کے پروردگار نے ان کو نوازا تو ان پر مہربانی سے توجہ فرمائی اور سیدھی راہ بتائی"},{"index":"2471","surah":"20","aya":"123","text":"فرمایا کہ تم دونوں یہاں سے نیچے اتر جاؤ۔ تم میں بعض بعض کے دشمن (ہوں گے) پھر اگر میری طرف سے تمہارے پاس ہدایت آئے تو جو شخص میری ہدایت کی پیروی کرے گا وہ نہ گمراہ ہوگا اور نہ تکلیف میں پڑے گا"},{"index":"2472","surah":"20","aya":"124","text":"اور جو میری نصیحت سے منہ پھیرے گا اس کی زندگی تنگ ہوجائے گی اور قیامت کو ہم اسے اندھا کرکے اٹھائیں گے"},{"index":"2473","surah":"20","aya":"125","text":"وہ کہے گا میرے پروردگار تو نے مجھے اندھا کرکے کیوں اٹھایا میں تو دیکھتا بھالتا تھا"},{"index":"2474","surah":"20","aya":"126","text":"خدا فرمائے گا کہ ایسا ہی (چاہیئے تھا) تیرے پاس میری آیتیں آئیں تو تونے ان کو بھلا دیا۔ اسی طرح آج ہم تجھ کو بھلا دیں گے"},{"index":"2475","surah":"20","aya":"127","text":"اور جو شخص حد سے نکل جائے اور اپنے پروردگار کی آیتوں پر ایمان نہ لائے ہم اس کو ایسا ہی بدلہ دیتے ہیں۔ اور آخرت کا عذاب بہت سخت اور بہت دیر رہنے والا ہے"},{"index":"2476","surah":"20","aya":"128","text":"کیا یہ بات ان لوگوں کے لئے موجب ہدایت نہ ہوئی کہ ہم ان سے پہلے بہت سے لوگوں کو ہلاک کرچکے ہیں جن کے رہنے کے مقامات میں یہ چلتے پھرتے ہیں۔ عقل والوں کے لئے اس میں (بہت سی) نشانیاں ہیں"},{"index":"2477","surah":"20","aya":"129","text":"اور اگر ایک بات تمہارے پروردگار کی طرف سے پہلے صادر اور (جزائے اعمال کے لئے) ایک میعاد مقرر نہ ہوچکی ہوتی تو (نزول) عذاب لازم ہوجاتا"},{"index":"2478","surah":"20","aya":"130","text":"پس جو کچھ یہ بکواس کرتے ہیں اس پر صبر کرو۔ اور سورج کے نکلنے سے پہلے اور اس کے غروب ہونے سے پہلے اپنے پروردگار کی تسبیح وتحمید کیا کرو۔ اور رات کی ساعات (اولین) میں بھی اس کی تسبیح کیا کرو اور دن کی اطراف (یعنی دوپہر کے قریب ظہر کے وقت بھی) تاکہ تم خوش ہوجاؤ"},{"index":"2479","surah":"20","aya":"131","text":"اور کئی طرح کے لوگوں کو جو ہم نے دنیا کی زندگی میں آرائش کی چیزوں سے بہرہ مند کیا ہے تاکہ ان کی آزمائش کریں ان پر نگاہ نہ کرنا۔ اور تمہاری پروردگار کی (عطا فرمائی ہوئی) روزی بہت بہتر اور باقی رہنے والی ہے"},{"index":"2480","surah":"20","aya":"132","text":"اور اپنے گھر والوں کو نماز کا حکم کرو اور اس پر قائم رہو۔ ہم تم سے روزی کے خواستگار نہیں۔ بلکہ تمہیں ہم روزی دیتے ہیں اور (نیک) انجام (اہل) تقویٰ کا ہے"},{"index":"2481","surah":"20","aya":"133","text":"اور کہتے ہیں کہ یہ (پیغمبر) اپنے پروردگار کی طرف سے ہمارے پاس کوئی نشانی کیوں نہیں لاتے۔ کیا ان کے پاس پہلی کتابوں کی نشانی نہیں آئی؟"},{"index":"2482","surah":"20","aya":"134","text":"اور اگر ہم ان کو پیغمبر (کے بھیجنے) سے پیشتر کسی عذاب سے ہلاک کردیتے تو وہ کہتے کہ اے ہمارے پروردگار تو نے ہماری طرف کوئی پیغمبر کیوں نہ بھیجا کہ ہم ذلیل اور رسوا ہونے سے پہلے تیرے کلام (واحکام) کی پیروی کرتے"},{"index":"2483","surah":"20","aya":"135","text":"کہہ دو کہ سب (نتائج اعمال) کے منتظر ہیں سو تم بھی منتظر رہو۔ عنقریب تم کو معلوم ہوجائے گا کہ (دین کے) سیدھے رستے پر چلنے والے کون ہیں اور (جنت کی طرف) راہ پانے والے کون ہیں (ہم یا تم)"}]}