{"data":[{"index":"5448","surah":"72","aya":"1","text":"(اے پیغمبر لوگوں سے) کہہ دو کہ میرے پاس وحی آئی ہے کہ جنوں کی ایک جماعت نے (اس کتاب کو) سنا تو کہنے لگے کہ ہم نے ایک عجیب قرآن سنا"},{"index":"5449","surah":"72","aya":"2","text":"جو بھلائی کا رستہ بتاتا ہے سو ہم اس پر ایمان لے آئے۔ اور ہم اپنے پروردگار کے ساتھ کسی کو شریک نہیں بنائیں گے"},{"index":"5450","surah":"72","aya":"3","text":"اور یہ کہ ہمارے پروردگار کی عظمت (شان) بہت بڑی ہے اور وہ نہ بیوی رکھتا ہے نہ اولاد"},{"index":"5451","surah":"72","aya":"4","text":"اور یہ کہ ہم میں سے بعض بےوقوف خدا کے بارے میں جھوٹ افتراء کرتا ہے"},{"index":"5452","surah":"72","aya":"5","text":"اور ہمارا (یہ) خیال تھا کہ انسان اور جن خدا کی نسبت جھوٹ نہیں بولتے"},{"index":"5453","surah":"72","aya":"6","text":"اور یہ کہ بعض بنی آدم بعض جنات کی پناہ پکڑا کرتے تھے (اس سے) ان کی سرکشی اور بڑھ گئی تھی"},{"index":"5454","surah":"72","aya":"7","text":"اور یہ کہ ان کا بھی یہی اعتقاد تھا جس طرح تمہارا تھا کہ خدا کسی کو نہیں جلائے گا"},{"index":"5455","surah":"72","aya":"8","text":"اور یہ کہ ہم نے آسمان کو ٹٹولا تو اس کو مضبوط چوکیداروں اور انگاروں سے سے بھرا پایا"},{"index":"5456","surah":"72","aya":"9","text":"اور یہ کہ پہلے ہم وہاں بہت سے مقامات میں (خبریں) سننے کے لئے بیٹھا کرتے تھے۔ اب کوئی سننا چاہے تو اپنے لئے انگارا تیار پائے"},{"index":"5457","surah":"72","aya":"10","text":"اور یہ کہ ہمیں معلوم نہیں کہ اس سے اہل زمین کے حق میں برائی مقصود ہے یا ان کے پروردگار نے ان کی بھلائی کا ارادہ فرمایا ہے"},{"index":"5458","surah":"72","aya":"11","text":"اور یہ کہ ہم میں کوئی نیک ہیں اور کوئی اور طرح کے۔ ہمارے کئی طرح کے مذہب ہیں"},{"index":"5459","surah":"72","aya":"12","text":"اور یہ کہ ہم نے یقین کرلیا ہے کہ ہم زمین میں (خواہ کہیں ہوں) خدا کو ہرا نہیں سکتے اور نہ بھاگ کر اس کو تھکا سکتے ہیں"},{"index":"5460","surah":"72","aya":"13","text":"اور جب ہم نے ہدایت (کی کتاب) سنی اس پر ایمان لے آئے۔ تو جو شخص اپنے پروردگار پر ایمان لاتا ہے اس کو نہ نقصان کا خوف ہے نہ ظلم کا"},{"index":"5461","surah":"72","aya":"14","text":"اور یہ کہ ہم میں بعض فرمانبردار ہیں اور بعض (نافرمان) گنہگار ہیں۔ تو جو فرمانبردار ہوئے وہ سیدھے رستے پر چلے"},{"index":"5462","surah":"72","aya":"15","text":"اور جو گنہگار ہوئے وہ دوزخ کا ایندھن بنے"},{"index":"5463","surah":"72","aya":"16","text":"اور (اے پیغمبر) یہ (بھی ان سے کہہ دو) کہ اگر یہ لوگ سیدھے رستے پر رہتے تو ہم ان کے پینے کو بہت سا پانی دیتے"},{"index":"5464","surah":"72","aya":"17","text":"تاکہ اس سے ان کی آزمائش کریں۔ اور جو شخص اپنے پروردگار کی یاد سے منہ پھیرے گا وہ اس کو سخت عذاب میں داخل کرے گا"},{"index":"5465","surah":"72","aya":"18","text":"اور یہ کہ مسجدیں (خاص) خدا کی ہیں تو خدا کے ساتھ کسی اور کی عبادت نہ کرو"},{"index":"5466","surah":"72","aya":"19","text":"اور جب خدا کے بندے (محمدﷺ) اس کی عبادت کو کھڑے ہوئے تو کافر ان کے گرد ہجوم کرلینے کو تھے"},{"index":"5467","surah":"72","aya":"20","text":"کہہ دو کہ میں تو اپنے پروردگار ہی کی عبادت کرتا ہوں اور کسی کو اس کا شریک نہیں بناتا"},{"index":"5468","surah":"72","aya":"21","text":"(یہ بھی) کہہ دو کہ میں تمہارے حق میں نقصان اور نفع کا کچھ اختیار نہیں رکھتا"},{"index":"5469","surah":"72","aya":"22","text":"(یہ بھی) کہہ دو کہ خدا (کے عذاب) سے مجھے کوئی پناہ نہیں دے سکتا۔ اور میں اس کے سوا کہیں جائے پناہ نہیں دیکھتا"},{"index":"5470","surah":"72","aya":"23","text":"ہاں خدا کی طرف سے احکام کا اور اس کے پیغاموں کا پہنچا دینا (ہی) میرے ذمے ہے۔ اور جو شخص خدا اور اس کے پیغمبر کی نافرمانی کرے گا تو ایسوں کے لئے جہنم کی آگ ہے ہمیشہ ہمیشہ اس میں رہیں گے"},{"index":"5471","surah":"72","aya":"24","text":"یہاں تک کہ جب یہ لوگ وہ (دن) دیکھ لیں گے جس کا ان سے وعدہ کیا جاتا ہے تب ان کو معلوم ہو جائے گا کہ مددگار کس کے کمزور اور شمار کن کا تھوڑا ہے"},{"index":"5472","surah":"72","aya":"25","text":"کہہ دو کہ جس (دن) کا تم سے وعدہ کیا جاتا ہے میں نہیں جانتا کہ وہ (عن) قریب (آنے والا ہے) یا میرے پروردگار نے اس کی مدت دراز کر دی ہے"},{"index":"5473","surah":"72","aya":"26","text":"غیب (کی بات) جاننے والا ہے اور کسی پر اپنے غیب کو ظاہر نہیں کرتا"},{"index":"5474","surah":"72","aya":"27","text":"ہاں جس پیغمبر کو پسند فرمائے تو اس (کو غیب کی باتیں بتا دیتا اور اس) کے آگے اور پیچھے نگہبان مقرر کر دیتا ہے"},{"index":"5475","surah":"72","aya":"28","text":"تاکہ معلوم فرمائے کہ انہوں نے اپنے پروردگار کے پیغام پہنچا دیئے ہیں اور (یوں تو) اس نے ان کی سب چیزوں کو ہر طرف سے قابو کر رکھا ہے اور ایک ایک چیز گن رکھی ہے"}]}