{"data":[{"index":"2484","surah":"21","aya":"1","text":"لوگوں کا حساب (اعمال کا وقت) نزدیک آپہنچا ہے اور وہ غفلت میں (پڑے اس سے) منہ پھیر رہے ہیں"},{"index":"2485","surah":"21","aya":"2","text":"ان کے پاس کوئی نئی نصیحت ان کے پروردگار کی طرف سے نہیں آتی مگر وہ اسے کھیلتے ہوئے سنتے ہیں"},{"index":"2486","surah":"21","aya":"3","text":"ان کے دل غفلت میں پڑے ہوئے ہیں اور ظالم لوگ (آپس میں) چپکے چپکے باتیں کرتے ہیں کہ یہ (شخص کچھ بھی) نہیں مگر تمہارے جیسا آدمی ہے۔ تو تم آنکھوں دیکھتے جادو (کی لپیٹ) میں کیوں آتے ہو"},{"index":"2487","surah":"21","aya":"4","text":"(پیغمبر نے) کہا کہ جو بات آسمان اور زمین میں (کہی جاتی) ہے میرا پروردگار اسے جانتا ہے۔ اور وہ سننے والا (اور) جاننے والا ہے"},{"index":"2488","surah":"21","aya":"5","text":"بلکہ (ظالم) کہنے لگے کہ (یہ قرآن) پریشان (باتیں ہیں جو) خواب (میں دیکھ لی) ہیں۔ (نہیں) بلکہ اس نے اس کو اپنی طرف سے بنا لیا ہے (نہیں) بلکہ (یہ شعر ہے جو اس) شاعر (کا نتیجہٴ طبع) ہے۔ تو جیسے پہلے (پیغمبر نشانیاں دے کر) بھیجے گئے تھے (اسی طرح) یہ بھی ہمارے پاس کوئی نشانی لائے"},{"index":"2489","surah":"21","aya":"6","text":"ان سے پہلے جن بستیوں کو ہم نے ہلاک کیا وہ ایمان نہیں لاتی تھیں۔ تو کیا یہ ایمان لے آئیں گے"},{"index":"2490","surah":"21","aya":"7","text":"اور ہم نے تم سے پہلے مرد ہی (پیغمبر بنا کر) بھیجے جن کی طرف ہم وحی بھیجتے تھے۔ اگر تم نہیں جانتے تو جو یاد رکھتے ہیں ان سے پوچھ لو"},{"index":"2491","surah":"21","aya":"8","text":"اور ہم نے ان کے لئے ایسے جسم نہیں بنائے تھے کہ کھانا نہ کھائیں اور نہ وہ ہمیشہ رہنے والے تھے"},{"index":"2492","surah":"21","aya":"9","text":"پھر ہم نے ان کے بارے میں (اپنا) وعدہ سچا کردیا تو ان کو اور جس کو چاہا نجات دی اور حد سے نکل جانے والوں کو ہلاک کردیا"},{"index":"2493","surah":"21","aya":"10","text":"ہم نے تمہاری طرف ایسی کتاب نازل کی ہے جس میں تمہارا تذکرہ ہے۔ کیا تم نہیں سمجھتے"},{"index":"2494","surah":"21","aya":"11","text":"اور ہم نے بہت سی بستیوں کو جو ستمگار تھیں ہلاک کر مارا اور ان کے بعد اور لوگ پیدا کردیئے"},{"index":"2495","surah":"21","aya":"12","text":"جب انہوں نے ہمارے (مقدمہ) عذاب کو دیکھا تو لگے اس سے بھاگنے"},{"index":"2496","surah":"21","aya":"13","text":"مت بھاگو اور جن (نعمتوں) میں تم عیش وآسائش کرتے تھے ان کی اور اپنے گھروں کی طرف لوٹ جاؤ۔ شاید تم سے (اس بارے میں) دریافت کیا جائے"},{"index":"2497","surah":"21","aya":"14","text":"کہنے لگے ہائے شامت بےشک ہم ظالم تھے"},{"index":"2498","surah":"21","aya":"15","text":"تو وہ ہمیشہ اسی طرح پکارتے رہے یہاں تک کہ ہم نے ان کو (کھیتی کی طرح) کاٹ کر (اور آگ کی طرح) بجھا کر ڈھیر کردیا"},{"index":"2499","surah":"21","aya":"16","text":"اور ہم نے آسمان اور زمین کو جو اور (مخلوقات) ان دونوں کے درمیان ہے اس کو لہوولعب کے لئے پیدا نہیں کیا"},{"index":"2500","surah":"21","aya":"17","text":"اگر ہم چاہتے کہ کھیل (کی چیزیں یعنی زن وفرزند) بنائیں تو اگر ہم کو کرنا ہوتا تو ہم اپنے پاس سے بنالیتے"},{"index":"2501","surah":"21","aya":"18","text":"بلکہ ہم سچ کو جھوٹ پر کھینچ مارتے ہیں تو وہ اس کا سر توڑ دیتا ہے اور جھوٹ اسی وقت نابود ہوجاتا ہے۔ اور جو باتیں تم بناتے ہو ان سے تمہاری ہی خرابی ہے"},{"index":"2502","surah":"21","aya":"19","text":"اور جو لوگ آسمانوں میں اور جو زمین میں ہیں سب اسی کے (مملوک اور اُسی کا مال) ہیں۔ اور جو (فرشتے) اُس کے پاس ہیں وہ اس کی عبادت سے نہ کنیاتے ہیں اور نہ اکتاتے ہیں"},{"index":"2503","surah":"21","aya":"20","text":"رات دن (اُس کی) تسبیح کرتے رہتے ہیں (نہ تھکتے ہیں) نہ اکتاتے ہیں"},{"index":"2504","surah":"21","aya":"21","text":"بھلا لوگوں نے جو زمین کی چیزوں سے (بعض کو) معبود بنا لیا ہے (تو کیا) وہ ان کو (مرنے کے بعد) اُٹھا کھڑا کریں گے؟"},{"index":"2505","surah":"21","aya":"22","text":"اگر آسمان اور زمین میں خدا کے سوا اور معبود ہوتے تو زمین وآسمان درہم برہم ہوجاتے۔ جو باتیں یہ لوگ بتاتے ہیں خدائے مالک عرش ان سے پاک ہے"},{"index":"2506","surah":"21","aya":"23","text":"وہ جو کام کرتا ہے اس کی پرستش نہیں ہوگی اور (جو کام یہ لوگ کرتے ہیں اس کی) ان سے پرستش ہوگی"},{"index":"2507","surah":"21","aya":"24","text":"کیا لوگوں نے خدا کو چھوڑ کر اور معبود بنالئے ہیں۔ کہہ دو کہ (اس بات پر) اپنی دلیل پیش کرو۔ یہ (میری اور) میرے ساتھ والوں کی کتاب بھی ہے اور جو مجھ سے پہلے (پیغمبر) ہوئے ہیں۔ ان کی کتابیں بھی ہیں۔ بلکہ (بات یہ ہے کہ) ان اکثر حق بات کو نہیں جانتے اور اس لئے اس سے منہ پھیر لیتے ہیں"},{"index":"2508","surah":"21","aya":"25","text":"اور جو پیغمبر ہم نےتم سے پہلے بھیجے ان کی طرف یہی وحی بھیجی کہ میرے سوا کوئی معبود نہیں تو میری ہی عبادت کرو"},{"index":"2509","surah":"21","aya":"26","text":"اور کہتے ہیں کہ خدا بیٹا رکھتا ہے۔ وہ پاک ہے (اس کے نہ بیٹا ہے نہ بیٹی) بلکہ (جن کو یہ لوگ اس کے بیٹے بیٹیاں سمجھتے ہیں) وہ اس کے عزت والے بندے ہیں"},{"index":"2510","surah":"21","aya":"27","text":"اس کے آگے بڑھ کر بول نہیں سکتے۔ اور اس کے حکم پر عمل کرتے ہیں"},{"index":"2511","surah":"21","aya":"28","text":"جو کچھ ان کے آگے ہوچکا ہے اور پیچھے ہوگا وہ سب سے واقف ہے اور وہ (اس کے پاس کسی کی) سفارش نہیں کرسکتے مگر اس شخص کی جس سے خدا خوش ہو اور وہ اس کی ہیبت سے ڈرتے رہتے ہیں"},{"index":"2512","surah":"21","aya":"29","text":"اور جو شخص ان میں سے یہ کہے کہ خدا کے سوا میں معبود ہوں تو اسے ہم دوزخ کی سزا دیں گے اور ظالموں کو ہم ایسی ہی سزا دیا کرتے ہیں"},{"index":"2513","surah":"21","aya":"30","text":"کیا کافروں نے نہیں دیکھا کہ آسمان اور زمین دونوں ملے ہوئے تھے تو ہم نے جدا جدا کردیا۔ اور تمام جاندار چیزیں ہم نے پانی سے بنائیں۔ پھر یہ لوگ ایمان کیوں نہیں لاتے؟"},{"index":"2514","surah":"21","aya":"31","text":"اور ہم نے زمین میں پہاڑ بنائے تاکہ لوگوں (کے بوجھ) سے ہلنے (اور جھکنے) نہ لگے اور اس میں کشادہ راستے بنائے تاکہ لوگ ان پر چلیں"},{"index":"2515","surah":"21","aya":"32","text":"اور آسمان کو محفوظ چھت بنایا۔ اس پر بھی وہ ہماری نشانیوں سے منہ پھیر رہے ہیں"},{"index":"2516","surah":"21","aya":"33","text":"اور وہی تو ہے جس نے رات اور دن اور سورج اور چاند کو بنایا۔ (یہ) سب (یعنی سورج اور چاند اور ستارے) آسمان میں (اس طرح چلتے ہیں گویا) تیر رہے ہیں"},{"index":"2517","surah":"21","aya":"34","text":"اور (اے پیغمبر) ہم نے تم سے پہلے کسی آدمی کو بقائے دوام نہیں بخشا۔ بھلا اگر تم مرجاؤ تو کیا یہ لوگ ہمیشہ رہیں گے"},{"index":"2518","surah":"21","aya":"35","text":"ہر متنفس کو موت کا مزا چکھنا ہے۔ اور ہم تو لوگوں کو سختی اور آسودگی میں آزمائش کے طور پر مبتلا کرتے ہیں۔ اور تم ہماری طرف ہی لوٹ کر آؤ گے"},{"index":"2519","surah":"21","aya":"36","text":"اور جب کافر تم کو دیکھتے ہیں تو تم سے استہزاء کرتے ہیں کہ کیا یہی شخص ہے جو تمہارے معبودوں کا ذکر (برائی سے) کیا کرتا ہے حالانکہ وہ خود رحمٰن کے نام سے منکر ہیں"},{"index":"2520","surah":"21","aya":"37","text":"انسان (کچھ ایسا جلد باز ہے کہ گویا) جلد بازی ہی سے بنایا گیا ہے۔ میں تم لوگوں کو عنقریب اپنی نشانیاں دکھاؤں گا تو تم جلدی نہ کرو"},{"index":"2521","surah":"21","aya":"38","text":"اور کہتے ہیں کہ اگر تم سچے ہو تو (جس عذاب کا) یہ وعید (ہے وہ) کب (آئے گا)؟"},{"index":"2522","surah":"21","aya":"39","text":"اے کاش کافر اس وقت کو جانیں جب وہ اپنے مونہوں پر سے (دوزخ کی) آگ کو روک نہ سکیں گے اور نہ اپنی پیٹھوں پر سے اور نہ ان کا کوئی مددگار ہوگا"},{"index":"2523","surah":"21","aya":"40","text":"بلکہ قیامت ان پر ناگہاں آ واقع ہوگی۔ اور ان کے ہوش کھو دے گی۔ پھر نہ تو وہ اس کو ہٹا سکیں گے اور نہ ان کو مہلت دی جائے گی"},{"index":"2524","surah":"21","aya":"41","text":"اور تم سے پہلے بھی پیغمبروں کے ساتھ استہزاء ہوتا رہا ہے تو جو لوگ ان میں سے تمسخر کیا کرتے تھے ان کو اسی (عذاب) نے جس کی ہنسی اُڑاتے تھے آگھیرا"},{"index":"2525","surah":"21","aya":"42","text":"کہو کہ رات اور دن میں خدا سے تمہاری کون حفاظت کرسکتا ہے؟ بات یہ ہے کہ اپنے پروردگار کی یاد سے منہ پھیرے ہوئے ہیں"},{"index":"2526","surah":"21","aya":"43","text":"کیا ہمارے سوا ان کے اور معبود ہیں کہ ان کو (مصائب سے) بچاسکیں۔ وہ آپ اپنی مدد تو کر ہی نہیں سکتے اور نہ ہم سے پناہ ہی دیئے جائیں گے"},{"index":"2527","surah":"21","aya":"44","text":"بلکہ ہم ان لوگوں کو اور ان کے باپ دادا کو متمتع کرتے رہے یہاں تک کہ (اسی حالت میں) ان کی عمریں بسر ہوگئیں۔ کیا یہ نہیں دیکھتے کہ ہم زمین کو اس کے کناروں سے گھٹاتے چلے آتے ہیں۔ تو کیا یہ لوگ غلبہ پانے والے ہیں؟"},{"index":"2528","surah":"21","aya":"45","text":"کہہ دو کہ میں تم کو حکم خدا کے مطابق نصیحت کرتا ہوں۔ اور بہروں کوجب نصیحت کی جائے تو وہ پکار کر سنتے ہی نہیں"},{"index":"2529","surah":"21","aya":"46","text":"اور اگر ان کو تمہارے پروردگار کا تھوڑا سا عذاب بھی پہنچے تو کہنے لگیں کہ ہائے کم بختی ہم بےشک ستمگار تھے"},{"index":"2530","surah":"21","aya":"47","text":"اور ہم قیامت کے دن انصاف کی ترازو کھڑی کریں گے تو کسی شخص کی ذرا بھی حق تلفی نہ کی جائے گی۔ اور اگر رائی کے دانے کے برابر بھی (کسی کا عمل) ہوگا تو ہم اس کو لاحاضر کریں گے۔ اور ہم حساب کرنے کو کافی ہیں"},{"index":"2531","surah":"21","aya":"48","text":"اور ہم نے موسیٰ اور ہارون کو (ہدایت اور گمراہی میں) فرق کر دینے والی اور (سرتاپا) روشنی اور نصیحت (کی کتاب) عطا کی (یعنی) پرہیز گاروں کے لئے"},{"index":"2532","surah":"21","aya":"49","text":"جو بن دیکھے اپنے پروردگار سے ڈرتے ہیں اور قیامت کا بھی خوف رکھتے ہیں"},{"index":"2533","surah":"21","aya":"50","text":"یہ مبارک نصیحت ہے جسے ہم نے نازل فرمایا ہے تو کیا تم اس سے انکار کرتے ہو؟"},{"index":"2534","surah":"21","aya":"51","text":"اور ہم نے ابراہیمؑ کو پہلے ہی سے ہدایت دی تھی اور ہم ان کے حال سے واقف تھے"},{"index":"2535","surah":"21","aya":"52","text":"جب انہوں نے اپنے باپ اور اپنی قوم کے لوگوں سے کہا یہ کیا مورتیں ہیں جن (کی پرستش) پر تم معتکف (وقائم) ہو؟"},{"index":"2536","surah":"21","aya":"53","text":"وہ کہنے لگے کہ ہم نے اپنے باپ دادا کو ان کی پرستش کرتے دیکھا ہے"},{"index":"2537","surah":"21","aya":"54","text":"(ابراہیم نے) کہا کہ تم بھی (گمراہ ہو) اور تمہارے باپ دادا بھی صریح گمراہی میں پڑے رہے"},{"index":"2538","surah":"21","aya":"55","text":"وہ بولے کیا تم ہمارے پاس (واقعی) حق لائے ہو یا (ہم سے) کھیل (کی باتیں) کرتے ہو؟"},{"index":"2539","surah":"21","aya":"56","text":"(ابراہیم نے) کہا (نہیں) بلکہ تمہارا پروردگار آسمانوں اور زمین کا پروردگار ہے جس نے ان کو پیدا کیا ہے۔ اور میں اس (بات) کا گواہ (اور اسی کا قائل) ہوں"},{"index":"2540","surah":"21","aya":"57","text":"اور خدا کی قسم جب تم پیٹھ پھیر کر چلے جاؤ گے تو میں تمہارے بتوں سے ایک چال چلوں گا"},{"index":"2541","surah":"21","aya":"58","text":"پھر ان کو توڑ کر ریزہ ریزہ کردیا مگر ایک بڑے (بت) کو (نہ توڑا) تاکہ وہ اس کی طرف رجوع کریں"},{"index":"2542","surah":"21","aya":"59","text":"کہنے لگے کہ ہمارے معبودوں کے ساتھ یہ معاملہ کس نے کیا؟ وہ تو کوئی ظالم ہے"},{"index":"2543","surah":"21","aya":"60","text":"لوگوں نے کہا کہ ہم نے ایک جوان کو ان کا ذکر کرتے ہوئے سنا ہے اس کو ابراہیم کہتے ہیں"},{"index":"2544","surah":"21","aya":"61","text":"وہ بولے کہ اسے لوگوں کے سامنے لاؤ تاکہ گواہ رہیں"},{"index":"2545","surah":"21","aya":"62","text":"(جب ابراہیم آئے تو) بت پرستوں نے کہا کہ ابراہیم بھلا یہ کام ہمارے معبودوں کے ساتھ تم نے کیا ہے؟"},{"index":"2546","surah":"21","aya":"63","text":"(ابراہیم نے) کہا (نہیں) بلکہ یہ ان کے اس بڑے (بت) نے کیا (ہوگا) ۔ اگر یہ بولتے ہیں تو ان سے پوچھ لو"},{"index":"2547","surah":"21","aya":"64","text":"انہوں نے اپنے دل غور کیا تو آپس میں کہنے لگے بےشک تم ہی بےانصاف ہو"},{"index":"2548","surah":"21","aya":"65","text":"پھر (شرمندہ ہو کر) سر نیچا کرلیا (اس پر بھی ابراہیم سے کہنے لگے کہ) تم جانتے ہو یہ بولتے نہیں"},{"index":"2549","surah":"21","aya":"66","text":"(ابراہیم نے) کہا پھر تم خدا کو چھوڑ کر کیوں ایسی چیزوں کو پوجتے ہو جو نہ تمہیں کچھ فائدہ دے سکیں اور نقصان پہنچا سکیں؟"},{"index":"2550","surah":"21","aya":"67","text":"تف ہے تم پر اور جن کو تم خدا کے سوا پوجتے ہو ان پر بھی کیا تم عقل نہیں رکھتے؟"},{"index":"2551","surah":"21","aya":"68","text":"(تب وہ) کہنے لگے کہ اگر تمہیں (اس سے اپنے معبود کا انتقام لینا اور) کچھ کرنا ہے تو اس کو جلا دو اور اپنے معبودوں کی مدد کرو"},{"index":"2552","surah":"21","aya":"69","text":"ہم نے حکم دیا اے آگ سرد ہوجا اور ابراہیم پر (موجب) سلامتی (بن جا)"},{"index":"2553","surah":"21","aya":"70","text":"اور ان لوگوں نے برا تو ان کا چاہا تھا مگر ہم نے ان ہی کو نقصان میں ڈال دیا"},{"index":"2554","surah":"21","aya":"71","text":"اور ابراہیم اور لوط کو اس سرزمین کی طرف بچا نکالا جس میں ہم نے اہل عالم کے لئے برکت رکھی تھی"},{"index":"2555","surah":"21","aya":"72","text":"اور ہم نے ابراہیم کو اسحق عطا کئے۔ اور مستزاد برآں یعقوب۔ اور سب کو نیک بخت کیا"},{"index":"2556","surah":"21","aya":"73","text":"اور ان کو پیشوا بنایا کہ ہمارے حکم سے ہدایت کرتے تھے اور ان کو نیک کام کرنے اور نماز پڑھنے اور زکوٰة دینے کا حکم بھیجا۔ اور وہ ہماری عبادت کیا کرتے تھے"},{"index":"2557","surah":"21","aya":"74","text":"اور لوط (کا قصہ یاد کرو) جب ان کو ہم نے حکم (یعنی حکمت ونبوت) اور علم بخشا اور اس بستی سے جہاں کے لوگ گندے کام کیا کرتے تھے۔ بچا نکالا۔ بےشک وہ برے اور بدکردار لوگ تھے"},{"index":"2558","surah":"21","aya":"75","text":"اور انہیں اپنی رحمت کے (محل میں) داخل کیا۔ کچھ شک نہیں کہ وہ نیک بختوں میں تھے"},{"index":"2559","surah":"21","aya":"76","text":"اور نوح (کا قصہ بھی یاد کرو) جب (اس سے) پیشتر انہوں نے ہم کو پکارا تو ہم نے ان کی دعا قبول فرمائی اور ان کو اور ان کے ساتھیوں کو بڑی گھبراہٹ سے نجات دی"},{"index":"2560","surah":"21","aya":"77","text":"اور جو لوگ ہماری آیتوں کی تکذیب کرتے تھے ان پر نصرت بخشی۔ وہ بےشک برے لوگ تھے سو ہم نے ان سب کو غرق کردیا"},{"index":"2561","surah":"21","aya":"78","text":"اور داؤد اور سلیمان (کا حال بھی سن لو کہ) جب وہ ایک کھیتی کا مقدمہ فیصلہ کرنے لگے جس میں کچھ لوگوں کی بکریاں رات کو چر گئی (اور اسے روند گئی) تھیں اور ہم ان کے فیصلے کے وقت موجود تھے"},{"index":"2562","surah":"21","aya":"79","text":"تو ہم نے فیصلہ (کرنے کا طریق) سلیمان کو سمجھا دیا۔ اور ہم نے دونوں کو حکم (یعنی حکمت ونبوت) اور علم بخشا تھا۔ اور ہم نے پہاڑوں کو داؤد کا مسخر کردیا تھا کہ ان کے ساتھ تسبیح کرتے تھے اور جانوروں کو بھی (مسخر کردیا تھا اور ہم ہی ایسا) کرنے والے تھے"},{"index":"2563","surah":"21","aya":"80","text":"اور ہم نے تمہارے لئے ان کو ایک (طرح) کا لباس بنانا بھی سکھا دیا تاکہ تم کو لڑائی (کے ضرر) سے بچائے۔ پس تم کو شکرگزار ہونا چاہیئے"},{"index":"2564","surah":"21","aya":"81","text":"اور ہم نے تیز ہوا سلیمان کے تابع (فرمان) کردی تھی جو ان کے حکم سے اس ملک میں چلتی تھی جس میں ہم نے برکت دی تھی (یعنی شام) اور ہم ہر چیز سے خبردار ہیں"},{"index":"2565","surah":"21","aya":"82","text":"اور دیوؤں (کی جماعت کو بھی ان کے تابع کردیا تھا کہ ان) میں سے بعض ان کے لئے غوطے مارتے تھے اور اس کے سوا اور کام بھی کرتے تھے اور ہم ان کے نگہبان تھے"},{"index":"2566","surah":"21","aya":"83","text":"اور ایوب کو (یاد کرو) جب انہوں نے اپنے پروردگار سے دعا کی کہ مجھے ایذا ہو رہی ہے اور تو سب سے بڑھ کر رحم کرنے والا ہے"},{"index":"2567","surah":"21","aya":"84","text":"تو ہم نے ان کی دعا قبول کرلی اور جو ان کو تکلیف تھی وہ دور کردی اور ان کو بال بچے بھی عطا فرمائے اور اپنی مہربانی کے ساتھ اتنے ہی اور (بخشے) اور عبادت کرنے والوں کے لئے (یہ) نصیحت ہے"},{"index":"2568","surah":"21","aya":"85","text":"اور اسمٰعیل اور ادریس اور ذوالکفل (کو بھی یاد کرو) یہ سب صبر کرنے والے تھے"},{"index":"2569","surah":"21","aya":"86","text":"اور ہم نے ان کو اپنی رحمت میں داخل کیا۔ بلاشبہ وہ نیکوکار تھے"},{"index":"2570","surah":"21","aya":"87","text":"اور ذوالنون (کو یاد کرو) جب وہ (اپنی قوم سے ناراض ہو کر) غصے کی حالت میں چل دیئے اور خیال کیا کہ ہم ان پر قابو نہیں پاسکیں گے۔ آخر اندھیرے میں (خدا کو) پکارنے لگے کہ تیرے سوا کوئی معبود نہیں۔ تو پاک ہے (اور) بےشک میں قصوروار ہوں"},{"index":"2571","surah":"21","aya":"88","text":"تو ہم نے ان کی دعا قبول کرلی اور ان کو غم سے نجات بخشی۔ اور ایمان والوں کو ہم اسی طرح نجات دیا کرتے ہیں"},{"index":"2572","surah":"21","aya":"89","text":"اور زکریا (کو یاد کرو) جب انہوں نے اپنے پروردگار کو پکارا کہ پروردگار مجھے اکیلا نہ چھوڑ اور تو سب سے بہتر وارث ہے"},{"index":"2573","surah":"21","aya":"90","text":"تو ہم نے ان کی پکار سن لی۔ اور ان کو یحییٰ بخشے اور ان کی بیوی کو اُن کے (حسن معاشرت کے) قابل بنادیا۔ یہ لوگ لپک لپک کر نیکیاں کرتے اور ہمیں امید سے پکارتے اور ہمارے آگے عاجزی کیا کرتے تھے"},{"index":"2574","surah":"21","aya":"91","text":"اور ان (مریم) کو (بھی یاد کرو) جنہوں نے اپنی عفّت کو محفوظ رکھا۔ تو ہم نے ان میں اپنی روح پھونک دی اور ان کے بیٹے کو اہل عالم کے لئے نشانی بنا دیا"},{"index":"2575","surah":"21","aya":"92","text":"یہ تمہاری جماعت ایک ہی جماعت ہے اور میں تمہارا پروردگار ہوں تو میری ہی عبادت کیا کرو"},{"index":"2576","surah":"21","aya":"93","text":"اور یہ لوگ اپنے معاملے میں باہم متفرق ہوگئے۔ (مگر) سب ہماری طرف رجوع کرنے والے ہیں"},{"index":"2577","surah":"21","aya":"94","text":"جو نیک کام کرے گا اور مومن بھی ہوگا تو اس کی کوشش رائیگاں نہ جائے گی۔ اور ہم اس کے لئے (ثواب اعمال) لکھ رہے ہیں"},{"index":"2578","surah":"21","aya":"95","text":"اور جس بستی (والوں) کو ہم نے ہلاک کردیا محال ہے کہ (وہ دنیا کی طرف رجوع کریں) وہ رجوع نہیں کریں گے"},{"index":"2579","surah":"21","aya":"96","text":"یہاں تک کہ یاجوج ماجوج کھول دیئے جائیں اور وہ ہر بلندی سے دوڑ رہے ہوں"},{"index":"2580","surah":"21","aya":"97","text":"اور (قیامت کا) سچا وعدہ قریب آجائے تو ناگاہ کافروں کی آنکھیں کھلی کی کھلی رہ جائیں (اور کہنے لگیں کہ) ہائے شامت ہم اس (حال) سے غفلت میں رہے بلکہ (اپنے حق میں) ظالم تھے"},{"index":"2581","surah":"21","aya":"98","text":"(کافرو اس روز) تم اور جن کی تم خدا کے سوا عبادت کرتے ہو دوزخ کا ایندھن ہوں گے۔ اور تم سب اس میں داخل ہو کر رہو گے"},{"index":"2582","surah":"21","aya":"99","text":"اگر یہ لوگ (درحقیقت) معبود ہوتے تو اس میں داخل نہ ہوتے۔ سب اس میں ہمیشہ (جلتے) رہیں گے"},{"index":"2583","surah":"21","aya":"100","text":"وہاں ان کو چلاّنا ہوگا اور اس میں (کچھ) نہ سن سکیں گے"},{"index":"2584","surah":"21","aya":"101","text":"جن لوگوں کے لئے ہماری طرف سے پہلے بھلائی مقرر ہوچکی ہے۔ وہ اس سے دور رکھے جائیں گے"},{"index":"2585","surah":"21","aya":"102","text":"(یہاں تک کہ) اس کی آواز بھی تو نہیں سنیں گے۔ اور جو کچھ ان کا جی چاہے گا اس میں (یعنی) ہر طرح کے عیش اور لطف میں ہمیشہ رہیں گے"},{"index":"2586","surah":"21","aya":"103","text":"ان کو (اس دن کا) بڑا بھاری خوف غمگین نہیں کرے گا۔ اور فرشتے ان کو لینے آئیں گے (اور کہیں گے کہ) یہی وہ دن ہے جس کا تم سے وعدہ کیا جاتا ہے"},{"index":"2587","surah":"21","aya":"104","text":"جس دن ہم آسمان کو اس طرح لپیٹ لیں گے جیسے خطوں کا طومار لپیٹ لیتے ہیں۔ جس طرح ہم نے (کائنات کو) پہلے پیدا کیا اسی طرح دوبارہ پیدا کردیں گے۔ (یہ) وعدہ (جس کا پورا کرنا لازم) ہے۔ ہم (ایسا) ضرور کرنے والے ہیں"},{"index":"2588","surah":"21","aya":"105","text":"اور ہم نے نصیحت (کی کتاب یعنی تورات) کے بعد زبور میں لکھ دیا تھا کہ میرے نیکوکار بندے ملک کے وارث ہوں گے"},{"index":"2589","surah":"21","aya":"106","text":"عبادت کرنے والے لوگوں کے لئے اس میں (خدا کے حکموں کی) تبلیغ ہے"},{"index":"2590","surah":"21","aya":"107","text":"اور (اے محمدﷺ) ہم نے تم کو تمام جہان کے لئے رحمت (بنا کر) بھیجا ہے"},{"index":"2591","surah":"21","aya":"108","text":"کہہ دو کہ مجھ پر (خدا کی طرف سے) یہ وحی آتی ہے کہ تم سب کا معبود خدائے واحد ہے۔ تو تم کو چاہیئے کہ فرمانبردار بن جاؤ"},{"index":"2592","surah":"21","aya":"109","text":"اگر یہ لوگ منہ پھیریں تو کہہ دو کہ میں نے تم کو سب کو یکساں (احکام الہیٰ سے) آگاہ کردیا ہے۔ اور مجھ کو معلوم نہیں کہ جس چیز کا تم سے وعدہ کیا جاتا ہے وہ (عن) قریب (آنے والی) ہے یا (اس کا وقت) دور ہے"},{"index":"2593","surah":"21","aya":"110","text":"اور جو بات پکار کی جائے وہ اسے بھی جانتا ہے اور جو تم پوشیدہ کرتے ہو اس سے بھی واقف ہے"},{"index":"2594","surah":"21","aya":"111","text":"اور میں نہیں جانتا شاید وہ تمہارے لئے آزمائش ہو اور ایک مدت تک (تم اس سے) فائدہ (اٹھاتے رہو)"},{"index":"2595","surah":"21","aya":"112","text":"پیغمبر نے کہا کہ اے میرے پروردگار حق کے ساتھ فیصلہ کردے۔ اور ہمارا پروردگار بڑا مہربان ہے اسی سے ان باتوں میں جو تم بیان کرتے ہو مدد مانگی جاتی ہے"}]}