{"data":[{"index":"4326","surah":"43","aya":"1","text":"حٰم"},{"index":"4327","surah":"43","aya":"2","text":"کتاب روشن کی قسم"},{"index":"4328","surah":"43","aya":"3","text":"کہ ہم نے اس کو قرآن عربی بنایا ہے تاکہ تم سمجھو"},{"index":"4329","surah":"43","aya":"4","text":"اور یہ بڑی کتاب (یعنی لوح محفوظ) میں ہمارے پاس (لکھی ہوئی اور) بڑی فضیلت اور حکمت والی ہے"},{"index":"4330","surah":"43","aya":"5","text":"بھلا اس لئے کہ تم حد سے نکلے ہوئے لوگ ہو ہم تم کو نصیحت کرنے سے باز رہیں گے"},{"index":"4331","surah":"43","aya":"6","text":"اور ہم نے پہلے لوگوں میں بھی بہت سے پیغمبر بھیجے تھے"},{"index":"4332","surah":"43","aya":"7","text":"اور کوئی پیغمبر ان کے پاس نہیں آتا تھا مگر وہ اس سے تمسخر کرتے تھے"},{"index":"4333","surah":"43","aya":"8","text":"تو جو ان میں سخت زور والے تھے ان کو ہم نے ہلاک کردیا اور اگلے لوگوں کی حالت گزر گئی"},{"index":"4334","surah":"43","aya":"9","text":"اور اگر تم ان سے پوچھو کہ آسمانوں اور زمین کو کس نے پیدا کیا ہے تو کہہ دیں گے کہ ان کو غالب اور علم والے (خدا) نے پیدا کیا ہے"},{"index":"4335","surah":"43","aya":"10","text":"جس نے تمہارے لئے زمین کو بچھونا بنایا۔ اور اس میں تمہارے لئے رستے بنائے تاکہ تم راہ معلوم کرو"},{"index":"4336","surah":"43","aya":"11","text":"اور جس نے ایک اندازے کے ساتھ آسمان سے پانی نازل کیا۔ پھر ہم نے اس سے شہر مردہ کو زندہ کیا۔ اسی طرح تم زمین سے نکالے جاؤ گے"},{"index":"4337","surah":"43","aya":"12","text":"اور جس نے تمام قسم کے حیوانات پیدا کئے اور تمہارے لئے کشتیاں اور چارپائے بنائے جن پر تم سوار ہوتے ہو"},{"index":"4338","surah":"43","aya":"13","text":"تاکہ تم ان کی پیٹھ پر چڑھ بیٹھو اور جب اس پر بیٹھ جاؤ پھر اپنے پروردگار کے احسان کو یاد کرو اور کہو کہ وہ (ذات) پاک ہے جس نے اس کو ہمارے زیر فرمان کر دیا اور ہم میں طاقت نہ تھی کہ اس کو بس میں کرلیتے"},{"index":"4339","surah":"43","aya":"14","text":"اور ہم اپنے پروردگار کی طرف لوٹ کر جانے والے ہیں"},{"index":"4340","surah":"43","aya":"15","text":"اور انہوں نے اس کے بندوں میں سے اس کے لئے اولاد مقرر کی۔ بےشک انسان صریح ناشکرا ہے"},{"index":"4341","surah":"43","aya":"16","text":"کیا اس نے اپنی مخلوقات میں سے خود تو بیٹیاں لیں اور تم کو چن کر بیٹے دیئے"},{"index":"4342","surah":"43","aya":"17","text":"حالانکہ جب ان میں سے کسی کو اس چیز کی خوشخبری دی جاتی ہے جو انہوں نے خدا کے لئے بیان کی ہے تو اس کا منہ سیاہ ہوجاتا اور وہ غم سے بھر جاتا ہے"},{"index":"4343","surah":"43","aya":"18","text":"کیا وہ جو زیور میں پرورش پائے اور جھگڑے کے وقت بات نہ کرسکے (خدا کی) بیٹی ہوسکتی ہے؟"},{"index":"4344","surah":"43","aya":"19","text":"اور انہوں نے فرشتوں کو کہ وہ بھی خدا کے بندے ہیں (خدا کی) بیٹیاں مقرر کیا۔ کیا یہ ان کی پیدائش کے وقت حاضر تھے عنقریب ان کی شہادت لکھ لی جائے گی اور ان سے بازپرس کی جائے گی"},{"index":"4345","surah":"43","aya":"20","text":"اور کہتے ہیں اگر خدا چاہتا تو ہم ان کو نہ پوجتے۔ ان کو اس کا کچھ علم نہیں۔ یہ تو صرف اٹکلیں دوڑا رہے ہیں"},{"index":"4346","surah":"43","aya":"21","text":"یا ہم نے ان کو اس سے پہلے کوئی کتاب دی تھی تو یہ اس سے سند پکڑتے ہیں"},{"index":"4347","surah":"43","aya":"22","text":"بلکہ کہنے لگے کہ ہم نے اپنے باپ دادا کو ایک رستے پر پایا ہے اور ہم انہی کے قدم بقدم چل رہے ہیں"},{"index":"4348","surah":"43","aya":"23","text":"اور اسی طرح ہم نے تم سے پہلے کسی بستی میں کوئی ہدایت کرنے والا نہیں بھیجا مگر وہاں کے خوشحال لوگوں نے کہا کہ ہم نے اپنے باپ دادا کو ایک راہ پر پایا اور ہم قدم بقدم ان ہی کے پیچھے چلتے ہیں"},{"index":"4349","surah":"43","aya":"24","text":"پیغمبر نے کہا اگرچہ میں تمہارے پاس ایسا (دین) لاؤں کہ جس رستے پر تم نے اپنے باپ دادا کو پایا وہ اس سے کہیں سیدھا رستہ دکھاتا ہے کہنے لگے کہ جو (دین) تم دے کر بھیجے گئے ہو ہم اس کو نہیں مانتے"},{"index":"4350","surah":"43","aya":"25","text":"تو ہم نے ان سے انتقام لیا سو دیکھ لو کہ جھٹلانے والوں کا انجام کیسا ہوا"},{"index":"4351","surah":"43","aya":"26","text":"اور جب ابراہیم نے اپنے باپ اور اپنی قوم کے لوگوں سے کہا کہ جن چیزوں کو تم پوجتے ہو میں ان سے بیزار ہوں"},{"index":"4352","surah":"43","aya":"27","text":"ہاں جس نے مجھ کو پیدا کیا وہی مجھے سیدھا رستہ دکھائے گا"},{"index":"4353","surah":"43","aya":"28","text":"اور یہی بات اپنی اولاد میں پیچھے چھوڑ گئے تاکہ وہ (خدا کی طرف) رجوع کریں"},{"index":"4354","surah":"43","aya":"29","text":"بات یہ ہے کہ میں ان کفار کو اور ان کے باپ دادا کو متمتع کرتا رہا یہاں تک کہ ان کے پاس حق اور صاف صاف بیان کرنے والا پیغمبر آ پہنچا"},{"index":"4355","surah":"43","aya":"30","text":"اور جب ان کے پاس حق (یعنی قرآن) آیا تو کہنے لگے کہ یہ تو جادو ہے اور ہم اس کو نہیں مانتے"},{"index":"4356","surah":"43","aya":"31","text":"اور (یہ بھی) کہنے لگے کہ یہ قرآن ان دونوں بستیوں (یعنی مکّے اور طائف) میں سے کسی بڑے آدمی پر کیوں نازل نہ کیا گیا؟"},{"index":"4357","surah":"43","aya":"32","text":"کیا یہ لوگ تمہارے پروردگار کی رحمت کو بانٹتے ہیں؟ ہم نے ان میں ان کی معیشت کو دنیا کی زندگی میں تقسیم کردیا اور ایک کے دوسرے پر درجے بلند کئے تاکہ ایک دوسرے سے خدمت لے اور جو کچھ یہ جمع کرتے ہیں تمہارے پروردگار کی رحمت اس سے کہیں بہتر ہے"},{"index":"4358","surah":"43","aya":"33","text":"اور اگر یہ خیال نہ ہوتا کہ سب لوگ ایک ہی جماعت ہوجائیں گے تو جو لوگ خدا سے انکار کرتے ہیں ہم ان کے گھروں کی چھتیں چاندی کی بنا دیتے اور سیڑھیاں (بھی) جن پر وہ چڑھتے ہیں"},{"index":"4359","surah":"43","aya":"34","text":"اور ان کے گھروں کے دروازے بھی اور تخت بھی جن پر تکیہ لگاتے ہیں"},{"index":"4360","surah":"43","aya":"35","text":"اور (خوب) تجمل وآرائش (کردیتے) اور یہ سب دنیا کی زندگی کا تھوڑا سا سامان ہے۔ اور آخرت تمہارے پروردگار کے ہاں پرہیزگاروں کے لئے ہے"},{"index":"4361","surah":"43","aya":"36","text":"اور جو کوئی خدا کی یاد سے آنکھیں بند کرکے (یعنی تغافل کرے) ہم اس پر ایک شیطان مقرر کردیتے ہیں تو وہ اس کا ساتھی ہوجاتا ہے"},{"index":"4362","surah":"43","aya":"37","text":"اور یہ (شیطان) ان کو رستے سے روکتے رہتے ہیں اور وہ سمجھتے ہیں کہ سیدھے رستے پر ہیں"},{"index":"4363","surah":"43","aya":"38","text":"یہاں تک کہ جب ہمارے پاس آئے گا تو کہے گا کہ اے کاش مجھ میں اور تجھ میں مشرق ومغرب کا فاصلہ ہوتا تو برا ساتھی ہے"},{"index":"4364","surah":"43","aya":"39","text":"اور جب تم ظلم کرتے رہے تو آج تمہیں یہ بات فائدہ نہیں دے سکتی کہ تم (سب) عذاب میں شریک ہو"},{"index":"4365","surah":"43","aya":"40","text":"کیا تم بہرے کو سنا سکتے ہو یا اندھے کو رستہ دکھا سکتے ہو اور جو صریح گمراہی میں ہو (اسے راہ پر لاسکتے ہو)"},{"index":"4366","surah":"43","aya":"41","text":"اگر ہم تم کو (وفات دے کر) اٹھا لیں تو ان لوگوں سے تو ہم انتقام لے کر رہیں گے"},{"index":"4367","surah":"43","aya":"42","text":"یا (تمہاری زندگی ہی میں) تمہیں وہ (عذاب) دکھا دیں گے جن کا ہم نے ان سے وعدہ کیا ہے ہم ان پر قابو رکھتے ہیں"},{"index":"4368","surah":"43","aya":"43","text":"پس تمہاری طرف جو وحی کی گئی ہے اس کو مضبوط پکڑے رہو۔ بےشک تم سیدھے رستے پر ہو"},{"index":"4369","surah":"43","aya":"44","text":"اور یہ (قرآن) تمہارے لئے اور تمہاری قوم کے لئے نصیحت ہے اور (لوگو) تم سے عنقریب پرسش ہوگی"},{"index":"4370","surah":"43","aya":"45","text":"اور (اے محمدﷺ) جو اپنے پیغمبر ہم نے تم سے پہلے بھیجے ہیں ان سے دریافت کرلو۔ کیا ہم نے (خدائے) رحمٰن کے سوا اور معبود بنائے تھے کہ ان کی عبادت کی جائے"},{"index":"4371","surah":"43","aya":"46","text":"اور ہم نے موسیٰ کو اپنی نشانیاں دے کر فرعون اور اس کے درباریوں کی طرف بھیجا تو انہوں نے کہا کہ میں پروردگار عالم کا بھیجا ہوا ہوں"},{"index":"4372","surah":"43","aya":"47","text":"جب وہ ان کے پاس ہماری نشانیاں لے کر آئے تو وہ نشانیوں سے ہنسی کرنے لگے"},{"index":"4373","surah":"43","aya":"48","text":"اور جو نشانی ہم ان کو دکھاتے تھے وہ دوسری سے بڑی ہوتی تھی اور ہم نے ان کو عذاب میں پکڑ لیا تاکہ باز آئیں"},{"index":"4374","surah":"43","aya":"49","text":"اور کہنے لگے کہ اے جادوگر اس عہد کے مطابق جو تیرے پروردگار نے تجھ سے کر رکھا ہے اس سے دعا کر بےشک ہم ہدایت یاب ہو جائیں گے"},{"index":"4375","surah":"43","aya":"50","text":"سو جب ہم نے ان سے عذاب کو دور کردیا تو وہ عہد شکنی کرنے لگے"},{"index":"4376","surah":"43","aya":"51","text":"اور فرعون نے اپنی قوم سے پکار کر کہا کہ اے قوم کیا مصر کی حکومت میرے ہاتھ میں نہیں ہے۔ اور یہ نہریں جو میرے (محلوں کے) نیچے بہہ رہی ہیں (میری نہیں ہیں) کیا تم دیکھتے نہیں"},{"index":"4377","surah":"43","aya":"52","text":"بےشک میں اس شخص سے جو کچھ عزت نہیں رکھتا اور صاف گفتگو بھی نہیں کرسکتا کہیں بہتر ہوں"},{"index":"4378","surah":"43","aya":"53","text":"تو اس پر سونے کے کنگن کیوں نہ اُتارے گئے یا (یہ ہوتا کہ) فرشتے جمع ہو کر اس کے ساتھ آتے"},{"index":"4379","surah":"43","aya":"54","text":"غرض اس نے اپنی قوم کی عقل مار دی۔ اور انہوں نے اس کی بات مان لی۔ بےشک وہ نافرمان لوگ تھے"},{"index":"4380","surah":"43","aya":"55","text":"جب انہوں نے ہم کو خفا کیا تو ہم نے ان سے انتقام لے کر اور ان سب کو ڈبو کر چھوڑا"},{"index":"4381","surah":"43","aya":"56","text":"اور ان کو گئے گزرے کردیا اور پچھلوں کے لئے عبرت بنا دیا"},{"index":"4382","surah":"43","aya":"57","text":"اور جب مریم کے بیٹے (عیسیٰ) کا حال بیان کیا گیا تو تمہاری قوم کے لوگ اس سے چِلا اُٹھے"},{"index":"4383","surah":"43","aya":"58","text":"اور کہنے لگے کہ بھلا ہمارے معبود اچھے ہیں یا عیسیٰ؟ انہوں نے عیسیٰ کی جو مثال بیان کی ہے تو صرف جھگڑنے کو۔ حقیقت یہ ہے یہ لوگ ہیں ہی جھگڑالو"},{"index":"4384","surah":"43","aya":"59","text":"وہ تو ہمارے ایسے بندے تھے جن پر ہم نے فضل کیا اور بنی اسرائیل کے لئے ان کو (اپنی قدرت کا) نمونہ بنا دیا"},{"index":"4385","surah":"43","aya":"60","text":"اور اگر ہم چاہتے تو تم میں سے فرشتے بنا دیتے جو تمہاری جگہ زمین میں رہتے"},{"index":"4386","surah":"43","aya":"61","text":"اور وہ قیامت کی نشانی ہیں۔ تو (کہہ دو کہ لوگو) اس میں شک نہ کرو اور میرے پیچھے چلو۔ یہی سیدھا رستہ ہے"},{"index":"4387","surah":"43","aya":"62","text":"اور (کہیں) شیطان تم کو (اس سے) روک نہ دے۔ وہ تو تمہارا اعلاینہ دشمن ہے"},{"index":"4388","surah":"43","aya":"63","text":"اور جب عیسیٰ نشانیاں لے کر آئے تو کہنے لگے کہ میں تمہارے پاس دانائی (کی کتاب) لے کر آیا ہوں۔ نیز اس لئے کہ بعض باتیں جن میں تم اختلاف کر رہے ہو تم کو سمجھا دوں۔ تو خدا سے ڈرو اور میرا کہا مانو"},{"index":"4389","surah":"43","aya":"64","text":"کچھ شک نہیں کہ خدا ہی میرا اور تمہارا پروردگار ہے پس اسی کی عبادت کرو۔ یہی سیدھا رستہ ہے"},{"index":"4390","surah":"43","aya":"65","text":"پھر کتنے فرقے ان میں سے پھٹ گئے۔ سو جو لوگ ظالم ہیں ان کی درد دینے والے دن کے عذاب سے خرابی ہے"},{"index":"4391","surah":"43","aya":"66","text":"یہ صرف اس بات کے منتظر ہیں کہ قیامت ان پر ناگہاں آموجود ہو اور ان کو خبر تک نہ ہو"},{"index":"4392","surah":"43","aya":"67","text":"(جو آپس میں) دوست (ہیں) اس روز ایک دوسرے کے دشمن ہوں گے۔ مگر پرہیزگار (کہ باہم دوست ہی رہیں گے)"},{"index":"4393","surah":"43","aya":"68","text":"میرے بندو آج تمہیں نہ کچھ خوف ہے اور نہ تم غمناک ہوگے"},{"index":"4394","surah":"43","aya":"69","text":"جو لوگ ہماری آیتوں پر ایمان لائے اور فرمانبردار ہوگئے"},{"index":"4395","surah":"43","aya":"70","text":"(ان سے کہا جائے گا) کہ تم اور تمہاری بیویاں عزت (واحترام) کے ساتھ بہشت میں داخل ہوجاؤ"},{"index":"4396","surah":"43","aya":"71","text":"ان پر سونے کی پرچوں اور پیالوں کا دور چلے گا۔ اور وہاں جو جی چاہے اور جو آنکھوں کو اچھا لگے (موجود ہوگا) اور (اے اہل جنت) تم اس میں ہمیشہ رہو گے"},{"index":"4397","surah":"43","aya":"72","text":"اور یہ جنت جس کے تم مالک کر دیئے گئے ہو تمہارے اعمال کا صلہ ہے"},{"index":"4398","surah":"43","aya":"73","text":"وہاں تمہارے لئے بہت سے میوے ہیں جن کو تم کھاؤ گے"},{"index":"4399","surah":"43","aya":"74","text":"(اور کفار) گنہگار ہمیشہ دوزخ کے عذاب میں رہیں گے"},{"index":"4400","surah":"43","aya":"75","text":"جو ان سے ہلکا نہ کیا جائے گا اور وہ اس میں نامید ہو کر پڑے رہیں گے"},{"index":"4401","surah":"43","aya":"76","text":"اور ہم نے ان پر ظلم نہیں کیا۔ بلکہ وہی (اپنے آپ پر) ظلم کرتے تھے"},{"index":"4402","surah":"43","aya":"77","text":"اور پکاریں گے کہ اے مالک تمہارا پروردگار ہمیں موت دے دے۔ وہ کہے گا کہ تم ہمیشہ (اسی حالت میں) رہو گے"},{"index":"4403","surah":"43","aya":"78","text":"ہم تمہارے پاس حق لے کر آئے ہیں لیکن تم اکثر حق سے ناخوش ہوتے رہے"},{"index":"4404","surah":"43","aya":"79","text":"کیا انہوں نے کوئی بات ٹھہرا رکھی ہے تو ہم بھی کچھ ٹھہرانے والے ہیں"},{"index":"4405","surah":"43","aya":"80","text":"کیا یہ لوگ یہ خیال کرتے ہیں کہ ہم ان کی پوشیدہ باتوں اور سرگوشیوں کو سنتے نہیں؟ ہاں ہاں (سب سنتے ہیں) اور ہمارے فرشتے ان کے پاس (ان کی سب باتیں) لکھ لیتے ہیں"},{"index":"4406","surah":"43","aya":"81","text":"کہہ دو کہ اگر خدا کے اولاد ہو تو میں (سب سے) پہلے (اس کی) عبادت کرنے والا ہوں"},{"index":"4407","surah":"43","aya":"82","text":"یہ جو کچھ بیان کرتے ہیں آسمانوں اور زمین کا مالک (اور) عرش کا مالک اس سے پاک ہے"},{"index":"4408","surah":"43","aya":"83","text":"تو ان کو بک بک کرنے اور کھیلنے دو۔ یہاں تک کہ جس دن کا ان سے وعدہ کیا جاتا ہے اس کو دیکھ لیں"},{"index":"4409","surah":"43","aya":"84","text":"اور وہی (ایک) آسمانوں میں معبود ہے اور (وہی) زمین میں معبود ہے۔ اور وہ دانا (اور) علم والا ہے"},{"index":"4410","surah":"43","aya":"85","text":"اور وہ بہت بابرکت ہے جس کے لئے آسمانوں اور زمین کی اور جو کچھ ان دونوں میں ہے سب کی بادشاہت ہے۔ اور اسی کو قیامت کا علم ہے اور اسی کی طرف تم لوٹ کر جاؤ گے"},{"index":"4411","surah":"43","aya":"86","text":"اور جن کو یہ لوگ خدا کے سوا پکارتے ہیں وہ سفارش کا کچھ اختیار نہیں رکھتے۔ ہاں جو علم ویقین کے ساتھ حق کی گواہی دیں (وہ سفارش کرسکتے ہیں)"},{"index":"4412","surah":"43","aya":"87","text":"اور اگر تم ان سے پوچھو کہ ان کو کس نے پیدا کیا ہے تو کہہ دیں گے کہ خدا نے۔ تو پھر یہ کہاں بہکے پھرتے ہیں؟"},{"index":"4413","surah":"43","aya":"88","text":"اور (بسااوقات) پیغمبر کہا کرتے ہیں کہ اے پروردگار یہ ایسے لوگ ہیں کہ ایمان نہیں لاتے"},{"index":"4414","surah":"43","aya":"89","text":"تو ان سے منہ پھیر لو اور سلام کہہ دو۔ ان کو عنقریب (انجام) معلوم ہوجائے گا"}]}