{"data":[{"index":"4847","surah":"54","aya":"1","text":"قیامت قریب آ پہنچی اور چاند شق ہوگیا"},{"index":"4848","surah":"54","aya":"2","text":"اور اگر (کافر) کوئی نشانی دیکھتے ہیں تو منہ پھیر لیتے ہیں اور کہتے ہیں کہ یہ ایک ہمیشہ کا جادو ہے"},{"index":"4849","surah":"54","aya":"3","text":"اور انہوں نے جھٹلایا اور اپنی خواہشوں کی پیروی کی اور ہر کام کا وقت مقرر ہے"},{"index":"4850","surah":"54","aya":"4","text":"اور ان کو ایسے حالات (سابقین) پہنچ چکے ہیں جن میں عبرت ہے"},{"index":"4851","surah":"54","aya":"5","text":"اور کامل دانائی (کی کتاب بھی) لیکن ڈرانا ان کو کچھ فائدہ نہیں دیتا"},{"index":"4852","surah":"54","aya":"6","text":"تو تم بھی ان کی کچھ پروا نہ کرو۔ جس دن بلانے والا ان کو ایک ناخوش چیز کی طرف بلائے گا"},{"index":"4853","surah":"54","aya":"7","text":"تو آنکھیں نیچی کئے ہوئے قبروں سے نکل پڑیں گے گویا بکھری ہوئی ٹڈیاں"},{"index":"4854","surah":"54","aya":"8","text":"اس بلانے والے کی طرف دوڑتے جاتے ہوں گے۔ کافر کہیں گے یہ دن بڑا سخت ہے"},{"index":"4855","surah":"54","aya":"9","text":"ان سے پہلے نوحؑ کی قوم نے بھی تکذیب کی تھی تو انہوں نے ہمارے بندے کو جھٹلایا اور کہا کہ دیوانہ ہے اور انہیں ڈانٹا بھی"},{"index":"4856","surah":"54","aya":"10","text":"تو انہوں نے اپنے پروردگار سے دعا کی کہ (بار الٓہا) میں (ان کے مقابلے میں) کمزور ہوں تو (ان سے) بدلہ لے"},{"index":"4857","surah":"54","aya":"11","text":"پس ہم نے زور کے مینہ سے آسمان کے دہانے کھول دیئے"},{"index":"4858","surah":"54","aya":"12","text":"اور زمین میں چشمے جاری کردیئے تو پانی ایک کام کے لئے جو مقدر ہوچکا تھا جمع ہوگیا"},{"index":"4859","surah":"54","aya":"13","text":"اور ہم نے نوحؑ کو ایک کشتی پر جو تختوں اور میخوں سے تیار کی گئی تھی سوار کرلیا"},{"index":"4860","surah":"54","aya":"14","text":"وہ ہماری آنکھوں کے سامنے چلتی تھی۔ (یہ سب کچھ) اس شخص کے انتقام کے لئے (کیا گیا) جس کو کافر مانتے نہ تھے"},{"index":"4861","surah":"54","aya":"15","text":"اور ہم نے اس کو ایک عبرت بنا چھوڑا تو کوئی ہے کہ سوچے سمجھے؟"},{"index":"4862","surah":"54","aya":"16","text":"سو (دیکھ لو کہ) میرا عذاب اور ڈرانا کیسا ہوا؟"},{"index":"4863","surah":"54","aya":"17","text":"اور ہم نے قرآن کو سمجھنے کے لئے آسان کردیا ہے تو کوئی ہے کہ سوچے سمجھے؟"},{"index":"4864","surah":"54","aya":"18","text":"عاد نے بھی تکذیب کی تھی سو (دیکھ لو کہ) میرا عذاب اور ڈرانا کیسا ہوا"},{"index":"4865","surah":"54","aya":"19","text":"ہم نے ان پر سخت منحوس دن میں آندھی چلائی"},{"index":"4866","surah":"54","aya":"20","text":"وہ لوگوں کو (اس طرح) اکھیڑے ڈالتی تھی گویا اکھڑی ہوئی کھجوروں کے تنے ہیں"},{"index":"4867","surah":"54","aya":"21","text":"سو (دیکھ لو کہ) میرا عذاب اور ڈرانا کیسا ہوا"},{"index":"4868","surah":"54","aya":"22","text":"اور ہم نے قرآن کو سمجھنے کے لئے آسان کردیا ہے تو کوئی ہے کہ سوچے سمجھے؟"},{"index":"4869","surah":"54","aya":"23","text":"ثمود نے بھی ہدایت کرنے والوں کو جھٹلایا"},{"index":"4870","surah":"54","aya":"24","text":"اور کہا کہ بھلا ایک آدمی جو ہم ہی میں سے ہے ہم اس کی پیروی کریں؟ یوں ہو تو ہم گمراہی اور دیوانگی میں پڑ گئے"},{"index":"4871","surah":"54","aya":"25","text":"کیا ہم سب میں سے اسی پر وحی نازل ہوئی ہے؟ (نہیں) بلکہ یہ جھوٹا خود پسند ہے"},{"index":"4872","surah":"54","aya":"26","text":"ان کو کل ہی معلوم ہوجائے گا کہ کون جھوٹا خود پسند ہے"},{"index":"4873","surah":"54","aya":"27","text":"(اے صالح) ہم ان کی آزمائش کے لئے اونٹنی بھیجنے والے ہیں تو تم ان کو دیکھتے رہو اور صبر کرو"},{"index":"4874","surah":"54","aya":"28","text":"اور ان کو آگاہ کردو کہ ان میں پانی کی باری مقرر کر دی گئی ہے۔ ہر (باری والے کو اپنی) باری پر آنا چاہیئے"},{"index":"4875","surah":"54","aya":"29","text":"تو ان لوگوں نے اپنے رفیق کو بلایا اور اس نے (اونٹنی کو پکڑ کر اس کی) کونچیں کاٹ ڈالیں"},{"index":"4876","surah":"54","aya":"30","text":"سو (دیکھ لو کہ) میرا عذاب اور ڈرانا کیسا ہوا"},{"index":"4877","surah":"54","aya":"31","text":"ہم نے ان پر (عذاب کے لئے) ایک چیخ بھیجی تو وہ ایسے ہوگئے جیسے باڑ والے کی سوکھی اور ٹوٹی ہوئی باڑ"},{"index":"4878","surah":"54","aya":"32","text":"اور ہم نے قرآن کو سمجھنے کے لئے آسان کردیا ہے تو کوئی ہے کہ سوچے سمجھے؟"},{"index":"4879","surah":"54","aya":"33","text":"لوط کی قوم نے بھی ڈر سنانے والوں کو جھٹلایا تھا"},{"index":"4880","surah":"54","aya":"34","text":"تو ہم نے ان پر کنکر بھری ہوا چلائی مگر لوط کے گھر والے کہ ہم نے ان کو پچھلی رات ہی سے بچا لیا"},{"index":"4881","surah":"54","aya":"35","text":"اپنے فضل سے۔ شکر کرنے والوں کو ہم ایسا ہی بدلہ دیا کرتے ہیں"},{"index":"4882","surah":"54","aya":"36","text":"اور لوطؑ نے ان کو ہماری پکڑ سے ڈرایا بھی تھا مگر انہوں نے ڈرانے میں شک کیا"},{"index":"4883","surah":"54","aya":"37","text":"اور ان سے ان کے مہمانوں کو لے لینا چاہا تو ہم نے ان کی آنکھیں مٹا دیں سو (اب) میرے عذاب اور ڈرانے کے مزے چکھو"},{"index":"4884","surah":"54","aya":"38","text":"اور ان پر صبح سویرے ہی اٹل عذاب آ نازل ہوا"},{"index":"4885","surah":"54","aya":"39","text":"تو اب میرے عذاب اور ڈرانے کے مزے چکھو"},{"index":"4886","surah":"54","aya":"40","text":"اور ہم نے قرآن کو سمجھنے کے لئے آسان کردیا ہے تو کوئی ہے کہ سوچے سمجھے؟"},{"index":"4887","surah":"54","aya":"41","text":"اور قوم فرعون کے پاس بھی ڈر سنانے والے آئے"},{"index":"4888","surah":"54","aya":"42","text":"انہوں نے ہماری تمام نشانیوں کو جھٹلایا تو ہم نے ان کو اس طرح پکڑ لیا جس طرح ایک قوی اور غالب شخص پکڑ لیتا ہے"},{"index":"4889","surah":"54","aya":"43","text":"(اے اہل عرب) کیا تمہارے کافر ان لوگوں سے بہتر ہیں یا تمہارے لئے (پہلی) کتابوں میں کوئی فارغ خطی لکھ دی گئی ہے"},{"index":"4890","surah":"54","aya":"44","text":"کیا یہ لوگ کہتے ہیں کہ ہماری جماعت بڑی مضبوط ہے"},{"index":"4891","surah":"54","aya":"45","text":"عنقریب یہ جماعت شکست کھائے گی اور یہ لوگ پیٹھ پھیر کر بھاگ جائیں گے"},{"index":"4892","surah":"54","aya":"46","text":"ان کے وعدے کا وقت تو قیامت ہے اور قیامت بڑی سخت اور بہت تلخ ہے"},{"index":"4893","surah":"54","aya":"47","text":"بےشک گنہگار لوگ گمراہی اور دیوانگی میں (مبتلا) ہیں"},{"index":"4894","surah":"54","aya":"48","text":"اس روز منہ کے بل دوزخ میں گھسیٹے جائیں گے اب آگ کا مزہ چکھو"},{"index":"4895","surah":"54","aya":"49","text":"ہم نے ہر چیز اندازہٴ مقرر کے ساتھ پیدا کی ہے"},{"index":"4896","surah":"54","aya":"50","text":"اور ہمارا حکم تو آنکھ کے جھپکنے کی طرح ایک بات ہوتی ہے"},{"index":"4897","surah":"54","aya":"51","text":"اور ہم تمہارے ہم مذہبوں کو ہلاک کرچکے ہیں تو کوئی ہے کہ سوچے سمجھے؟"},{"index":"4898","surah":"54","aya":"52","text":"اور جو کچھ انہوں نے کیا، (ان کے) اعمال ناموں میں (مندرج) ہے"},{"index":"4899","surah":"54","aya":"53","text":"(یعنی) ہر چھوٹا اور بڑا کام لکھ دیا گیا ہے"},{"index":"4900","surah":"54","aya":"54","text":"جو پرہیزگار ہیں وہ باغوں اور نہروں میں ہوں گے"},{"index":"4901","surah":"54","aya":"55","text":"(یعنی) پاک مقام میں ہر طرح کی قدرت رکھنے والے بادشاہ کی بارگاہ میں"}]}